[About Language File]
Comments=اذا وجدت خطا في الترجمة اعلمني لاصلحه محدث الترجمة فتحي الداودية
Date=02.08.2020
Email=saifxman10@yahoo.com
Version=9.4.0

[AboutDialog]
ButtonDonations=المتبرعون
ButtonOK=موافق
Caption=&Text Editor Pro حول
LabelCopyright=الحقوق %s.كلها محفوظة.
LabelDevelopmentEnvironment=مركز التطوير
LabelIcons=الايقونات
LabelLanguageFileContributors=المساهمون في الترجمة
LabelMemoryAvailable=الذاكرة المتاحة للوندوز: %s
LabelThirdPartyComponents=3rd مكونات المجموعة
LabelVersion=الاصدار %s (%d-bit)

[AskYesOrNo]
CancelSearch=الغاء البحث, هل انت متاكد?
CloseDirectory=غلق المجلد %s,هل انت متاكد?
DeleteDirectory=حذف المجلد %s, هل انت متاكد?
DeleteFile=حذف الملف %s, هل انت متاكد?
DeleteLine=حذف الخط, هل انت متاكد?
NewVersion=اصدار جديد  %s of %sمتوفر.%sهل تريد تحميله من الانترنت?
RecordMacro=تسجيل اختصار جديد, هل انت متاكد?
ReopenFileWithEncoding=اعد فتح الملف "%s" التشفير?
ReplaceOccurence=استبدال هذا الملف المعطوب "%s"?
ResetColor=اعادة تعيين %s لون ، هل انت متاكد?
SaveChanges=حفظ التغييرات?
SearchMatchNotFound=لم يتم ايجاد بحث مطابق.%sاعد البحث من بداية الملف?
SearchStringNotFound=سلسلة البحث "%s" غير موجودة

[ChangedFilesDialog]
ButtonCancel=الغاء الامر
ButtonReload=اعادة تحميل
Caption:t=الترجمة المطلوبة
Caption=اعادة تحميل الملفات التي تم تغييرها
VirtualDrawTree:0=الملف
VirtualDrawTree:1=المسار

[ClipboardHistoryDialog]
ActionClearAll=مسح الكل
ActionCopyToClipboard=نسخ الى الحافظة
ActionInsertInEditor=ادراج في محرر
Caption=سجل الحافظة

[ColorConstant]
SColorBoxCustomCaption=تخصيص...
SName3DDkShadow=ظل 3 الابعاد قاتم
SName3DLight=ضوء3 الابعاد
SNameActiveBorder=حدود نشطة
SNameActiveCaption=التعليق النشط
SNameAppWorkSpace=مساحة عمل التطبيق
SNameAqua=مائي
SNameBackground=الخلفية
SNameBlack=اسود
SNameBlue=ازرق
SNameBtnFace=وجه الزر
SNameBtnHighlight=تمييز الزر
SNameBtnShadow=ظل زر
SNameBtnText=زر كتابة
SNameCaptionText=نص الشرح
SNameCream=كريم
SNameDefault=&افتراضي
SNameFuchsia=ارجواني
SNameGradientActiveCaption=التدرج التوضيحي النشط
SNameGradientInactiveCaption=التدرج التوضيحي غير النشط
SNameGray=رمادي
SNameGrayText=نص رمادي
SNameGreen=اخضر
SNameHighlight=تمييز الخلفية
SNameHighlightText=تمييزالنص
SNameHotLight=ضوء نشط
SNameInactiveBorder=حد غير نشط
SNameInactiveCaption=تعليق غير نشط
SNameInactiveCaptionText=نص التعليق غير النشط
SNameInfoBk=خلفية المعلومات
SNameInfoText=نص المعلومات
SNameLime=ليموني
SNameMaroon=كستنائي
SNameMedGray=رمادي متوسط
SNameMenu=خلفية القائمة
SNameMenuBar=شريط القوائم
SNameMenuHighlight=تمييز القائمة
SNameMenuText=نص القائمة
SNameMoneyGreen=المال الخضراء
SNameNavy=بحري
SNameNone=لاشئ
SNameOlive=زيتون
SNamePurple=ارجواني
SNameRed=احمر
SNameScrollBar=شريط التمرير
SNameSilver=فضة
SNameSkyBlue=ازرق سماوي
SNameTeal=بطي
SNameWhite=ابيض
SNameWindow=خلفية النافذة
SNameWindowFrame=اطار النافذة
SNameWindowText=نص النافذة
SNameYellow=اصفر

[CompareForm]
ActionExit:h=خروج من مقارنة النص
ActionExit=خروج
ActionLeftCopy:h=انسخ الخط الحالي الى الملف الصحيح
ActionLeftCopy=نسخ
ActionLeftFileOpen:h=فتح ملف موجود
ActionLeftFileOpen=فتح
ActionLeftFileSave:h=حفظ الملف
ActionLeftFileSave=حفظ
ActionLeftNext:h=الانتقال الى الفرق التالي
ActionLeftNext:s=F3
ActionLeftNext=&التالي
ActionLeftPrevious:h=الانتقال الى الفرق السابق
ActionLeftPrevious:s=Shift+F3
ActionLeftPrevious=السابق
ActionLeftReload:h=اعادة تحميل الملف الحالي
ActionLeftReload=اعادة تحميل
ActionLeftSwap:h=تبديل الخط الحالي بالملف الصحيح
ActionLeftSwap=مبادلة
ActionOptions:h=خيارات مقارنه النص
ActionOptions=الخيارات
ActionRightCopy:h=انسخ السطر الحالي الى الملف الايسر
ActionRightCopy=نسخ
ActionRightFileOpen:h=افتح ملف موجود
ActionRightFileOpen=فتح
ActionRightFileSave:h=حفظ الملف
ActionRightFileSave=حفظ
ActionRightNext:h=الانتقال الى الفرق التالي
ActionRightNext:s=F4
ActionRightNext=&التالي
ActionRightPrevious:h=الانتقال الى الفرق السابق
ActionRightPrevious:s=Shift+F4
ActionRightPrevious=&السابق
ActionRightReload:h=اعادة تحميل الملف الحالي
ActionRightReload=اعادة تحميل
ActionRightSwap:h=تبديل الخط الحالي مع الملف الايسر
ActionRightSwap=مبادلة
ActionSearchFindPrevious:h=&اوجد السابق
ActionSearchFindPrevious:s=Shift+Ctrl+F3
ActionSearchFindNext:h=&اوجد التالي
ActionSearchFindNext:s=Ctrl+F3
ActionSearchMatchCase:h=حساسية الموضوع
ActionSearchMatchCase=حساسية الموضوع
ActionSearchWholeWords:h=الكلمة الكاملة فقط
ActionSearchWholeWords=الكلمة الكاملة فقط
ActionSearchClose:h=اغلاق
Caption=مقارنة النص

[CompareOptionsDialog]
ButtonCancel=الغاء الامر
ButtonOK=&موافق
Caption=خيارات مقارنه النص
CheckBoxIgnoreBlanks=تجاهل الفراغات
CheckBoxIgnoreCase=تجاهل الكشف
CheckBoxShowSpecialChars=اظهر رموز خاصة
ComboBoxColorTheme=الوان

[ConfirmReplaceDialog]
ButtonCancel=الغاء الامر
ButtonNo=&لا
ButtonYes=&نعم
ButtonYesToAll=نعم &للكل
Caption=تاكيد التغيير

[Constant]
Active=&نشط
AllFiles=كل الملفات
Arrow=المؤشر
AutoSave=حفظ تلقائي
Block=منع
Bookmark=العلامة
Bottom=الاسفل
Bytes=بايت
CharacterCount:t=الترجمة المطلوبة
CharacterCount=عدد الاحرف
Circle=دائرة
Color=لون
CompareFiles=موازنة الملفات
Confirmation=التاكيد
CountingFiles=احصاء الملفات...
Default:t=الترجمة المطلوبة
Default=افتراضي
DirectoryItems=مواد المجلد
Dot=نقطة
Download=تحميل
DownloadCancelling=يتم الالغاء...
DownloadDone=انجز.
EditDirectory=تعديل المجلد
Encoding=&التشفير
Enter=دخول
Error=خطا
Extended=تمديد - \n, \t, \0
FileMaskItems=مواد الملف الخفية
FilesFound=%d ملفات تم ايجادها في %s
Gigabyte=GB
GoToBookmark=اذهب الى المرجعية
GoToLine=انتقل الى السطر
HalfBlock=الكتلة النصفية
Hide=اخفاء
Highlighter=المميز
HorizontalLine=خط افقي
Hovered=تارجح
Inactive=غير نشط
Information=معلومات
Insert=ادخال
InsertTags=ادخال HTML/XML اشارات
Installer=التركيب
InvalidName=اسم غير صالح
Kilobyte=ك.ب
LanguageEditor=محرر اللغة - %s
Length:t= الترجمة المطلوبة
Length=الطول
Line=سطر
LineCount:t= الترجمة المطلوبة
LineCount= عدد الاسطر
LoadingFiles=تحميل ملفات...
LoadingOutput=جارٍ تحميل المخرجات ...
MatchFound=%dمطابق%s وجد
MatchFoundPluralExtension=es
Megabyte=م.ب
Memory:t= الترجمة المطلوبة
Memory= الذاكرة
Minute=دق
Modified=تم التعديل
NewFolder=مجلد جديد
Normal=عادي
OccurencesFound=%d محطم(s) تم ايجاده في %s
Open=افتح
OpenDirectory=افتح مجلد
Overwrite=كتابة
Page=صفحة
Pilcrow=Pilcrow
Position=الموقع: %d
PreviewFilePage=الصفحة: $PAGENUM$ من $PAGECOUNT$
PreviewPage=الصفحة: %d of %d
PreviewPrintFile=طبع (%s)|طبع المستند على %s
PrintedBy=تمت طباعته بواسطة %s
RegularExpression=تعبير قياسي
Rename=هل تريد اعادة تسمية %s to %s?
RenameFailed=%s فشلت اعادة التسمية
ReopenItems=اعد فتح المواد
Results=النتائج
RightMargin=الهامش الايمن
SaveAs=حفظ باسم
Search=البحث
SearchFor=ابحث عن "%s"
SearchItems=مواد البحث
Second=ثانية
SelectRootDirectory=تحديد مجلد الجذر
SelectWorkingDirectory=حدد دليل العمل
Separator=الفاصل
Solid=صلب
Speed:t= الترجمة المطلوبة
Speed=Speed
Square=مربع
TextToFindItems=اكتب لايجاد مواد
ThinHorizontalLine=سطر افقي رفيع
ThinVerticalLine=سطر عمودي رفيع
ToggleBookmark=تبديل الاشارة المرجعية
Top=اعلى
TopLine=خط اعلى: %d
Triangle=مثلث
Untitled=معنونه
VersionInfoNotFound=معلموات الاصدار غير موجودة.
VerticalLine=سطر عمودي
Warning=تحذير
Width=العرض
Wildcard=البدل - *, ?
WordCount:t= الترجمة المطلوبة
WordCount= عدد الكلمات
ZipPackage=الحزمة البريدية

[ConvertConstant]
AcreFeet=قدم هكتار
AcreInches=بوصة هكتار
Acres=الهكتار
Angstroms=الانغستروم
Area=منطقه
Ares=هكتار
AstronomicalUnits=الوحدات الفلكية
Binary=ثنائي
Celsius=مئوي
Centares=سنتي هكتار
Centigrams=سينتغرام
CentiLiters=سنتيلتر
Centimeters=سنتيمتر
Centuries=قرون
Chains=السلاسل
CordFeet=قدم وتري
Cords=الاوتار
CubicCentimeters=سنتيمتر مكعب
CubicDecameters=ديكامتر مكعب
CubicDecimeters=ديسيمتر مكعب
CubicFeet=قدم مكعب
CubicHectometers=هيكتومتر مكعب
CubicInches=بوصة مكعبة
CubicKilometers=كيلومتر مكعب
CubicMeters=متر مكعب
CubicMiles=ميل مكعب
CubicMillimeters=مليمتير مكعب
CubicYards=ياردة مكعبة
Cubits=المقياس
DateTime=التاريخ
Days=ايام
Decades=عقود
Decagrams=ديكاغرام
DecaLiters=ديكالتر
Decameters=ديكامتر
Decasteres=المنكسرات
Decigrams=ديسيغرام
DeciLiters=ديسيلتر
Decimal=عشري
Decimeters=ديسيمتر
Decisteres=القرارات
Distance=المسافة
Drams=درام
DryBuckets=دلاء جافة
DryBushels= بوشل جاف
DryGallons= جالونات جافة
DryPecks=البقع الجافة
DryPints=مكاييل جافة
DryQuarts=الكوارتات الجافة
Fahrenheit=فهرنهايت
Fathoms=القامات
Feet=قدم
FluidCups=اكواب السوائل
FluidGallons=غالون السوائل
FluidGills=خياشيم السوائل
FluidOunces=اوقية السوائل
FluidPints=مكملات السوائل
FluidQuarts=السوائل الكوارتات
FluidTablespoons=ملاعق السوائل
FluidTeaspoons=ملعقة سوائل صغيرة
Fortnights=اسبوعين
Furlongs=الفرلنغ
Gigameters=غيغامتر
Grains=الحبوب
Grams=غرام
Hands=يد
Hectares=هكتارات
Hectograms=هيكتوغرام
HectoLiters=هيكتولتر
Hectometers=هكتامتر
Hexadecimal=عشري
Hours=ساعات
Inches=بوصة
JulianDate=تاريخ جولياني
Kelvin=كلفن
Kilograms=كيلوغرام
KiloLiters=كيلولتر
Kilometers=كيلومتر
LightYears=سنة ضوئية
Links=الروابط
Liters=لتر
LongTons=الطن الطويل
Mass=الكتلة
Megameters=ميغامتر
Meters=متر
MetricTons=الطن المتري
Micrograms=مايكروغرام
Micromicrons=الميكرونات الدقيقة
Microns=ميكرون
Miles=ميل
Millennia=الالفية
Milligrams=ميليغرام
MilliLiters=مليلتر
Millimeters=مليمتر
Millimicrons=ميلي ميكرون
MilliSeconds=ملي ثانية
Minutes=دقائق
ModifiedJulianDate=تعديل تاريخ جولياني
Months=شهور
Nanograms=نانوغرام
NauticalMiles=ميل بحري
NumeralSystem=النظام الرقمي
Ounces=اونصة
Paces=الخطوات
Parsecs=برسيكس
Picas=الحروف المطبعية
Points=النقاط
Pounds=رطل
Rankine=Rankine
Reaumur=Reaumur
Rods=القضبان
Seconds=ثواني
SquareCentimeters=سنتيمتر مربع
SquareDecameters=ديكامتر مربع
SquareDecimeters=ديسيمتر مربع
SquareFeet=قدم مربعة
SquareHectometers=هيكتومترمربع
SquareInches=بوصة مربعة
SquareKilometers=كيلومتر مربع
SquareMeters=متر مربع
SquareMiles=ميل مربع
SquareMillimeters=مليمتر مربع
SquareRods=قضبان مربعة
SquareYards=ياردة مربعة
Steres=ستير متر مكعب
Stones=الحجارة
Temperature=درجة الحرارة
Time=الوقت
Tons=الطن
UKBuckets=دلاء بريطاني
UKBushels=مكيال للحبوب البريطاني
UKGallons=الغالونات البريطانية
UKGill= الخياشيم البريطانية
UKOunces=الاونصة البريطانية
UKPecks=مقياس الجفاف البريطانية
UKPints=نصف لتر بريطاني
UKPottle=نصف غالون البريطانية
UKQuarts=الكوارتات البريطانية
Weeks=اسابيع
Volume=الحجم
Yards=ياردة
Years=سنوات

[ConvertForm]
Caption=تحويل بين الوحدات الرقمية
ComboBoxFrom=من
ComboBoxTo=الى
ComboBoxType=النوع
EditResult=النتيجة
EditValue=القيمة

[DialogConstant]
SMsgDlgAbort=&احباط
SMsgDlgAll=&الكل
SMsgDlgCancel=الغاء الامر
SMsgDlgClose=&اغلاق
SMsgDlgConfirm=تاكيد
SMsgDlgError=خطا
SMsgDlgHelp=&التعليمات
SMsgDlgHelpHelp=التعليمات
SMsgDlgHelpNone=لاتوجد تعليمات متوفرة
SMsgDlgIgnore=&تجاهل
SMsgDlgInformation=معلومات
SMsgDlgNo=&لا
SMsgDlgNoToAll=&لا للكل
SMsgDlgOK=موافق
SMsgDlgRetry=&اعد المحاولة
SMsgDlgWarning=تحذير
SMsgDlgYes=&نعم
SMsgDlgYesToAll=نعم &للكل
SNoMappingForUnicodeCharacter=لا يوجد اي تخطيط لحرف Unicode في صفحة الاكواد المستهدفة متعددة البايت

[DirectoryTabDialog]
ButtonCancel=الغاء الامر
ButtonOK=&موافق
CheckBoxExcludeOtherDirectoryBranches=تضمين فروع المجلد الاخرى
ComboBoxDrives=التعاريف
ComboBoxFileMask=الملف المخفي
EditRootDirectory=مجلد الجذر
EditTabName=اسم التبويب
GroupBoxOptions=الاختيارات

[DownloadURLDialog]
ActionCancel=الغاء الامر
ActionOK=&موافق
Caption=تحميل

[EditorColorElements]
ActiveLineBackground=خلفية السطر النشط
ActiveLineForeground=مقدمة السطر النشط
Background=خلفية
CodeFoldingActiveLineBackground=رمز للطي خلفية خط نشط
CodeFoldingBackground=خلفية طي الكود
CodeFoldingCollapsedLine=خط مطوي طي الشفرة
CodeFoldingFoldingLine=كود للطي طي الخط
CodeFoldingFoldingLineHighlight=رمز للطي خط للطي مميز
CodeFoldingHintBackground=قانون للطي تلميح الخلفية
CodeFoldingHintBorder=رمز تلميح للطي الحدود
CodeFoldingHintIndicatorBackground=رمز خلفية مؤشر تلميح للطي
CodeFoldingHintIndicatorBorder=حدود مؤشر تلميح رمز الطي
CodeFoldingHintIndicatorMark=رمز مؤشر علامة تلميح للطي
CodeFoldingHintText=نص تلميح قانون للطي
CodeFoldingIndent=رمز المسافة البادئة
CodeFoldingIndentHighlight=رمز المسافة البادئة للطي قابلة للطي
CompletionProposalBackground=خلفية اقتراح الاكمال
CompletionProposalForeground=اقتراح الانتهاء من المقدمة
CompletionProposalSelectedBackground=اقتراح الانتهاء مختارة الخلفية
CompletionProposalSelectedText=اقتراح انهاء النص المحدد
LeftMarginActiveLineBackground=خلفية خط الهامش الايسر
LeftMarginBackground=خلفية الهامش الايسر
LeftMarginBookmarkPanel=لوحة اشارة الهامش الايسر
LeftMarginBorder=حدود الهامش الايسر
LeftMarginLineNumberLine=خط رقم خط الهامش الايسر
LeftMarginLineNumbers=ارقام خط الهامش الايسر
LeftMarginLineStateModified=تم تعديل حالة خط الهامش الايسر
LeftMarginLineStateNormal=حالة خط الهامش الايسر عادية
MatchingPairMatched=مطابقه ثنائي متطابق
MatchingPairUnmatched=مطابقه ثنائي لا مثيل لها
MinimapBackground=خلفيه الخريطة المصغرة
MinimapBookmark=خريطة مصغرة المرجعية
MinimapVisibleLines=الخطوط المرئية للخريطة المصغرة
RightMargin=الهامش الايمن
RightMovingEdge=الحافة المتحركة اليمنى
RulerBackground=خلفيه المسطرة
RulerBorder=حدود المساطر
RulerLines=خطوط المسطرة
RulerMovingEdge=حافه مسطره متحركة
RulerNumbers=ارقام المسطرة
RulerSelection=اختيار المسطرة
SearchHighlighterBackground=بحث عن خلفية التمييز
SearchHighlighterBorder=بحث عن حدود قلم التمييز
SearchHighlighterForeground=بحث عن قلم التمييز
SearchInSelectionBackground=البحث في خلفية الاختيار
SearchMapActiveLine=خريطة البحث خط نشط
SearchMapBackground=بحث خريطة الخلفية
SearchMapForeground=ابحث في خريطة المقدمة
SelectionBackground=خلفية الاختيار
SelectionForeground=اختيار المقدمة
SyncEditBackground=مزامنة تحرير الخلفية
SyncEditEditBorder=تزامن تحرير تحرير الحدود
SyncEditWordBorder=تزامن تحرير كلمة الحدود
WordWrapIndicatorArrow=كلمة مؤشر التفاف السهم
WordWrapIndicatorLines=خطوط مؤشر التفاف الكلمة

[ErrorMessage]
EnterPath=ادخل المسار.
EnterTabName=ادخل اسم التبويب.
FileNotFound=الملف "%s" غير موجود.
DirectoryNotExist=غير موجود "%s" دليل
DirectoryNotExist:t= الترجمة المطلوبة
RootDirectoryNotExist=مجلد الجذر غير موجود.
ScaleChange:t= الترجمة المطلوبة
ScaleChange=قد لا يتم عرض بعض تغييرات القياس بشكل صحيح حتى تقوم باعادة تشغيل التطبيق.
DefaultEmailProgramNotFound=لا يمكن العثور على برنامج لارسال البريد الالكتروني

[ExecuteDialog]
ActionDelete:h=حذف مادة
ActionDelete=حذف
ActionEdit:h=تعديل مادة
ActionEdit=تصحيح
ActionInsert:h=ادخال مادة
ActionInsert=ادخال
ActionMoveDown:h=حرك المواد المحددة الى الاسفل
ActionMoveDown=تحريك للاسفل
ActionMoveUp:h=حرك المواد المحددة الى الاعلى
ActionMoveUp=تحريك للاعلى
ActionSort:h=فرز المواد
ActionSort=فرز
ButtonCancel=الغاء الامر
ButtonOK=&موافق
Caption=تنفيذ المواد

[ExecuteEditDialog]
ButtonCancel=الغاء الامر
ButtonOK=&موافق
Caption=تنفيذ البند
ComboBoxShortcut=اختصار
EditFilename=اسم الملف
EditParameters=المعلمات
EditTitle=عنوان
EditWorkingDirectory=عمل اخراجي

[FilesSelectDialog]
ActionSelectAll:h=حدد كل الملفات
ActionSelectAll=تحديد الكل
ActionUnselectAll:h=الغاء تحديد كل الملفات
ActionUnselectAll=الغاء تحديد الكل
ButtonCancel=الغاء الامر
ButtonOK=&موافق
Caption:t= الترجمة المطلوبة
Caption=حدد الملفات
VirtualDrawTree:0=الملف
VirtualDrawTree:1=المسار

[FileTypes]
7Zip=7-Zip ملفات مضغوطة (*.7z)|*.7z
ABAP=ملفات ABAP (*.abap)
ActionScript=ملفات ActionScript (*.as)
ASP=ملفات ASP (*.asp)
Assembler - 6502=ملفات 6502 Assembler (*.asm)
Assembler - 68HC11=ملفات 68HC11 Assembler (*.hc11;*.asc)
AutoIt v3=ملفات AutoIt (*.au3)
AWK=ملفات AWK scripts (*.awk)
Bash=ملفات Bash (*.sh)
C#=ملفات C# (*.cs)
C++=ملفات C++ (*.cpp;*.hpp)
C=ملفات C (*.c;*.h)
CoffeeScript=ملفات CoffeeScript (*.coffee)
CSS=ملفات Cascading Stylesheet (*.css)
D=ملفات D (*.d;*.di)
Delphi Form Module=ملفات Delphi Form Module (*.dfm)
Diff=ملفات Difference (*.diff)
Eiffel=ملفات Eiffel (*.e;*.es)
Erlang=ملفات Erlang (*.erl;*.hrl)
Exe=الملفات القابلة للتنفيذ (*.exe)|*.exe
F#=ملفات F# (*.fs)
Free Pascal=ملفات Free Pascal (*.pp)
FreeBASIC=ملفات FreeBASIC (*.bi;*.bas)
GDScript=ملفات GDScript (*.gd)
GLSL=ملفات GLSL (*.glsl)
Go=ملفات Go (*.go)
Gravity=ملفات Gravity (*.gravity)
Groovy=ملفات Groovy (*.groovy;*.gvy;*.gy;*.gsh)
HTML with Scripts=ملفات HTML (*.html;*.htm)
INI=ملفات INI (*.ini;*.lng)
Inno Setup=ملفات Inno Setup (*.iss)
Java=ملفات Java (*.java)
JavaScript=ملفات JavaScript (*.js)
JSON=ملفات JSON (*.json)
Julia=ملفات Julia (*.jl)
Kotlin=ملفات Kotlin (*.kt;*.kts)
Language=ملفات اللغة (*.lng)|*.lng
LaTex=ملفات LaTex (*.lat;*.tex;*.lex)
Lisp=ملفات Lisp (*.lisp)
Lua=ملفات Lua (*.lua)
Macro=ملفات الماكرو (*.mcr)|*.mcr
Markdown=ملفات Markdown (*.md)
MATLAB=ملفات MATLAB (*.matlab)
MIME=ملفات MIME (*.eml;*.mht)
MS-DOS Batch=ملفات MS-DOS Batch (*.bat;*.cmd)
MSI=ملفات MSI (*.msi)
Object Pascal=ملفات Pascal (*.pas;*.dpr;*.dpk)
Objective-C=ملفات Objective-C (*.m)
OCaml=ملفات OCaml (*.ml)
Perl=ملفات Perl (*.pl;*.pm;*.cgi)
PHP=ملفات PHP (*.php;*.class;*.inc)
PowerShell=ملفات PowerShell (*.ps1)
Python=ملفات Python (*.py)
R=ملفات R (*.r;*.rdata;*.rds;*.rda)
Ruby=ملفات Ruby (*.rb;*.rbw)
Rust=ملفات Rust (*.rc)
Scala=ملفات Scala (*.scala)
SQL - Standard=ملفات SQL (*.sql)
Swift=ملفات Swift (*.swift)
TclTk=ملفات Tcl/Tk (*.tcl)
Text=ملفات نصية (*.txt)
TypeScript=ملفات TypeScript (*.ts)
UnrealScript=ملفات UnrealScript (*.uc)
Visual Basic=ملفات Visual Basic (*.vb;*.bas)
XML=ملفات XML (*.xml;*.xsd;*.dtd;*.dproj;*.groupproj;*.wxs)
XSL=ملفات XSL (*.xsl;*.xslt)
YAML=ملفات YAML (*.yml)
Zip=Zip ملفات مضغوطة (*.zip)|*.zip

[FindDuplicatesDialog]
ActionFileMaskItems=مواد الملف الخفية...
ActionDirectoryItems=مواد المجلد...
ButtonCancel=الغاء الامر
ButtonOK=&موافق
Caption=البحث عن التكرارات
CheckBoxIgnoreBlanks=تجاهل الفراغات
CheckBoxIgnoreCase=تجاهل الكشف
CheckBoxIncludeSubdirectories=تضمين مجلدات فرعية
CheckBoxScanHorizontally=الفحص افقيا
CheckBoxScanVertically=الفحص عموديا
ComboBoxDirectories=مجلد
ComboBoxFileMask=ملف مخفي
GroupBoxOptions=الخيارات
GroupBoxSearch=البحث
GroupBoxSearchDirectoryOptions=البحث في خيارات الدليل
RadioButtonSearchAllOpenFiles=ابحث في كل الملفات المفتوحة
RadioButtonSearchInDirectories=البحث في الدلائل
SpinEditMinimumBlockSize=الحد الادنى لحجم الكتلة
SpinEditMinimumCharacters=الحد الادنى من الحروف

[FindInFilesDialog]
ActionSearchEngine=حدد محرك البحث
ActionTextToFindItems=كتب لايجاد مواد...
ActionFileMaskItems=مواد الملف الخفية...
ActionDirectoryItems=مواد المجلد...
ButtonCancel=الغاء الامر
ButtonOK=&موافق
Caption=اوجد في الملف
CheckBoxMatchCase=اكتشاف حالة الاحرف
CheckBoxDisplayResultsInSeparateTab=عرض النتائج في علامة تبويب منفصلة
CheckBoxGroupResultsByFile=نتائج المجموعة حسب الملف
CheckBoxIncludeSubdirectories=تضمين مجلدات فرعية
CheckBoxWholeWords=الكلمة الكاملة فقط
ComboBoxDirectories:h=يتم فصل دلائل متعددة بفاصلة منقوطة
ComboBoxDirectories=مجلد
ComboBoxFileMask=ملف مخفي
ComboBoxTextToFind=نص لايجاد
GroupBoxOptions=الاختيارات
GroupBoxOutputOptions=النتيجة
GroupBoxSearchDirectoryOptions=ابحث في خيارات المجلد

[HighlighterColorElements]
AssemblerComment=تعليق المجمع
AssemblerReservedWord=كلمة المجمّع المحجوزة
Attribute=السمة
Character=حرف
Comment=تعليق
Directive=توجيهات
Editor=محرر
HexNumber=رقم سداسي
HighlightedBlock=كتلة مميزة
Number=رقم
ReservedWord=كلمة محجوزة
String=سلسله
Symbol=رمز

[HighlighterFontElements]
CodeFoldingHint=تلميح رمز للطي
CompletionProposal=اقتراح الاكمال
LineNumbers=ارقام الاسطر
Minimap=مصغره
Ruler=مسطرة
Text=نص

[InformationDialog]
Caption=معلومات
LabelAccessed=الوصول
LabelCharacterCount=عدد الرموز
LabelCreated=انشاء
LabelFilename=اسم الملف
LabelLength=الطول
LabelLength:t= الترجمة المطلوبة
LabelLineCount=عدد الخطوط
LabelLocation=موقعك
LabelModified=تم التعديل
LabelSize=حجم
LabelSizeOnDisk=الحجم على القرص
LabelWordCount=sعدد الكلمات
ButtonOK=&موافق

[InputQueryDialog]
ButtonCancel=الغاء الامر
ButtonOK=&موافق

[ItemListDialog]
ActionClearAll:h=مسح كل المواد
ActionClearAll=مسح الكل
ActionDelete:h=حذف مادة
ActionDelete=حذف
ActionInsert:h=ادخال مادة
ActionInsert=ادخال
ActionMoveDown:h=حرك المواد المحددة الى الاسفل
ActionMoveDown=تحريك للاسفل
ActionMoveUp:h=حرك المواد المحددة الى الاعلى
ActionMoveUp=تحرك للاعلى
ActionSort:h=فرز المواد
ActionSort=فرز
ButtonCancel=الغاء الامر
ButtonOK=&موافق

[LanguageEditorForm]
ActionExit:h=اغلاق محرر اللغة
ActionExit=خروج
ActionFileNew:h=انشاء ملف لغة جديد
ActionFileNew=جديد
ActionFileOpen:h=فتح ملف صيغة اللغة
ActionFileOpen=فتح
ActionFileSave:h=حفظ ملف اللغة
ActionFileSave=حفظ
VirtualDrawTree:0=الوظيفة
VirtualDrawTree:1=الشرح
VirtualDrawTree:2=المعلومة
VirtualDrawTree:3=الاختصار
VirtualDrawTree:4:t= الترجمة المطلوبة
VirtualDrawTree:4=اختصار ثانوي

[MainForm]
ActionDirectoryContextMenu:h=قائمة المحتويات
ActionDirectoryContextMenu=&قائمة المحتويات
ActionDirectoryDelete:h=حذف الملف او المجلد
ActionDirectoryDelete=&حذف
ActionDirectoryFindInFiles:h=ابحث عن سلسلة في الملفات المتعددة
ActionDirectoryFindInFiles=&اوجد داخل الملفات...
ActionDirectoryNewFolder=مجلد جديد
ActionDirectoryOpenAllFiles:h=افتح كل الملفات من الدليل
ActionDirectoryOpenAllFiles=افتح كل الملفات
ActionDirectoryProperties:h=شاهد خصائص الملف او المجلد
ActionDirectoryProperties=&الخصائص...
ActionDirectoryRefresh:h=اعادة انعاش الملفات
ActionDirectoryRefresh=&اعادة انعاش
ActionDirectoryRename:h=اعد تسمية الملف\المجلد
ActionDirectoryRename=اعد &التسمية
ActionEdit=&تحرير
ActionEditCopy:h=انسخ المحدد وضعهة في ذاكرة النصوص
ActionEditCopy:s=Ctrl+C
ActionEditCopy=نسخ
ActionEditCopyWithLineNumbers:t= الترجمة المطلوبة
ActionEditCopyWithLineNumbers:h=انسخ المحدد وضعهة في ذاكرة النصوص
ActionEditCopyWithLineNumbers:s=Ctrl+Alt+C
ActionEditCopyWithLineNumbers=نسخ بارقام السطر
ActionEditCut:h=قص المحدد وضعه في ذاكرة النصوص
ActionEditCut:s=Ctrl+X
ActionEditCut=&قص
ActionEditDecode:h=فك شفره
ActionEditDecode=فك شفره
ActionEditDecodeASCIIDecimal:h=العشرية ASCII فك شفرة
ActionEditDecodeASCIIDecimal=ASCII decimal
ActionEditDecodeBase:h=Decode base
ActionEditDecodeBase=Base
ActionEditDecodeBase1024:h=Decode base1024
ActionEditDecodeBase1024=1024
ActionEditDecodeBase128:h=Decode base128
ActionEditDecodeBase128=128
ActionEditDecodeBase256:h=Decode base256
ActionEditDecodeBase256=256
ActionEditDecodeBase32:h=Decode base32
ActionEditDecodeBase32=32
ActionEditDecodeBase4096:h=Decode base4096
ActionEditDecodeBase4096=4096
ActionEditDecodeBase64:h=Decode base64
ActionEditDecodeBase64=64
ActionEditDecodeBase85:h=Decode base85
ActionEditDecodeBase85=85
ActionEditDecodeBase91:h=Decode base91
ActionEditDecodeBase91=91
ActionEditDecodeBinary:h=Decode binary
ActionEditDecodeBinary=&ثنائي
ActionEditDecodeHex:h=Decode hex
ActionEditDecodeHex=Hex
ActionEditDecodeHTML:h=Decode HTML
ActionEditDecodeHTML=HTML
ActionEditDecodeOctal:h=فك الثماني
ActionEditDecodeOctal=&ثماني
ActionEditDecodeRotate:h=فك التدوير
ActionEditDecodeRotate=&استدارة
ActionEditDecodeRotate13:h=تدوير من 13 مكانا
ActionEditDecodeRotate13=تدوير من 13 مكانا
ActionEditDecodeRotate18:h=تدوير من 18 مكانا
ActionEditDecodeRotate18=تدوير من 18 مكانا
ActionEditDecodeRotate47:h=تدوير من 47 مكانا
ActionEditDecodeRotate47=تدوير من 47 مكانا
ActionEditDecodeRotate5:h=تدوير بنسبة 5 اماكن
ActionEditDecodeRotate5=تدوير بنسبة 5 اماكن
ActionEditDecodeURL:h=فك شفرة عنوان رابط
ActionEditDecodeURL=&رابط
ActionEditDelete=&حذف
ActionEditDeleteBeginningOfLine:t=Translation needed
ActionEditDeleteBeginningOfLine:h=Delete beginning of line
ActionEditDeleteBeginningOfLine:s=Shift+Ctrl+T
ActionEditDeleteBeginningOfLine=Beginning of line
ActionEditDeleteDuplicateLines:h=حذف الاسطر المكررة
ActionEditDeleteDuplicateLines=&اسطر مكررة
ActionEditDeleteEndOfLine:h=حذف نهاية السطر
ActionEditDeleteEndOfLine:s=Shift+Ctrl+Y
ActionEditDeleteEndOfLine=&نهاية السطر
ActionEditDeleteLine:h=حذف السطر
ActionEditDeleteLine:s=Ctrl+Y
ActionEditDeleteLine=&السطر
ActionEditDeleteWhitespace:h=احذ النص المحدد
ActionEditDeleteWhitespace=&فراغ ابيض
ActionEditDeleteWord:h=حذف الكلمة
ActionEditDeleteWord:s=Ctrl+W
ActionEditDeleteWord=&الكلمة
ActionEditDeleteWordBackward:t=Translation needed
ActionEditDeleteWordBackward:h=Delete word backward
ActionEditDeleteWordBackward:s=Ctrl+BkSp
ActionEditDeleteWordBackward=Word backward
ActionEditDeleteWordForward:t=Translation needed
ActionEditDeleteWordForward:h=Delete word forward
ActionEditDeleteWordForward:s=Ctrl+Del
ActionEditDeleteWordForward=Word forward
ActionEditEncode:h=ترميز
ActionEditEncode=ترميز
ActionEditEncodeASCIIDecimal:h=Encode ASCII decimal
ActionEditEncodeASCIIDecimal=ASCII decimal
ActionEditEncodeBase:h=Encode base
ActionEditEncodeBase=Base
ActionEditEncodeBase1024:h=Encode base1024
ActionEditEncodeBase1024=1024
ActionEditEncodeBase128:h=Encode base128
ActionEditEncodeBase128=128
ActionEditEncodeBase256:h=Encode base256
ActionEditEncodeBase256=256
ActionEditEncodeBase32:h=Encode base32
ActionEditEncodeBase32=32
ActionEditEncodeBase4096:h=Encode base4096
ActionEditEncodeBase4096=4096
ActionEditEncodeBase64:h=Encode base64
ActionEditEncodeBase64=64
ActionEditEncodeBase64WithLineBreaks:h=Encode base64 with line breaks
ActionEditEncodeBase64WithLineBreaks=64 (with line breaks)
ActionEditEncodeBase85:h=Encode base85
ActionEditEncodeBase85=85
ActionEditEncodeBase91:h=Encode base91
ActionEditEncodeBase91=91
ActionEditEncodeBinary:h=Encode binary
ActionEditEncodeBinary=&ثنائي
ActionEditEncodeHex:h=Encode hex
ActionEditEncodeHex=Hex
ActionEditEncodeHTML:h=Encode HTML
ActionEditEncodeHTML=HTML
ActionEditEncodeOctal:h=ترميز ثماني
ActionEditEncodeOctal=&ثماني
ActionEditEncodeRotate:h=تشفير تدوير
ActionEditEncodeRotate=&استدارة
ActionEditEncodeRotate13:h=تدوير من 13 مكانا
ActionEditEncodeRotate13=تدوير من 13 مكانا
ActionEditEncodeRotate18:h=تدوير من 18 مكانا
ActionEditEncodeRotate18=تدوير من 18 مكانا
ActionEditEncodeRotate47:h=تدوير من 47 مكانا
ActionEditEncodeRotate47=تدوير من 47 مكانا
ActionEditEncodeRotate5:h=تدوير بنسبة 5 اماكن
ActionEditEncodeRotate5=تدوير بنسبة 5 اماكن
ActionEditEncodeURL:h=ترميز رابط
ActionEditEncodeURL=&رابط
ActionEditFormatJSON=صيغة JSON
ActionEditFormatJSONIndent2=الطلب  2
ActionEditFormatJSONIndent3=الطلب  3
ActionEditFormatJSONIndent4=الطلب  4
ActionEditFormatJSONMinify=تصغير
ActionEditFormatSQL:h=صيغة SQL
ActionEditFormatSQL=صيغة SQL
ActionEditFormatXML=صيغة XML
ActionEditFormatXMLFormat=صيغة
ActionEditFormatXMLMinify=تصغير
ActionEditIndentDecrease:h=انخفاض المسافة البادئة
ActionEditIndentDecrease:s=Shift+Ctrl+U
ActionEditIndentDecrease=&تخفيض
ActionEditIndentIncrease:h=زيادة المسافة البادئة
ActionEditIndentIncrease:s=Shift+Ctrl+I
ActionEditIndentIncrease=&زيادة
ActionEditInsert=ادخال
ActionEditInsertBlockComment:h=تبديل تعليق كتلة. الاختصار هو Ctrl+Shift+VK_OEM_2. The VK_OEM_2 يمكن ان يختلف المفتاح الافتراضي باختلاف لوحة المفاتيح. بالنسبة للوحة المفاتيح القياسية بالولايات المتحدة ، فهي '/?' مفتاح.
ActionEditInsertBlockComment=&حظر التعليق
ActionEditInsertDateTime:h=ادخال التاريخ والوقت
ActionEditInsertDateTime:s=Shift+Alt+D
ActionEditInsertDateTime=&التاريخ والوقت
ActionEditInsertGUID:h=ادخل GUID
ActionEditInsertGUID:s=Shift+Ctrl+G
ActionEditInsertGUID=GUID
ActionEditInsertHexColor:h=&الوان الهيكس
ActionEditInsertHexColor:s=Shift+Alt+C
ActionEditInsertHexColor=&الوان الهيكس
ActionEditInsertLine:h=ادخال سطر
ActionEditInsertLine:s=Ctrl+Enter
ActionEditInsertLine=&السطر
ActionEditInsertLineComment:h=تبديل تعليق الخط. الاختصار هو Ctrl+VK_OEM_2. The VK_OEM_2 يمكن ان يختلف المفتاح الافتراضي باختلاف لوحة المفاتيح. بالنسبة للوحة المفاتيح القياسية بالولايات المتحدة ، فهي '/?' مفتاح.
ActionEditInsertLineComment=&تعليق الخط
ActionEditInsertTag:h=ادخال HTML/XML اشارة
ActionEditInsertTag:s=Ctrl+T
ActionEditInsertTag=&HTML/XMLاشارة...
ActionEditModify=تعديل
ActionEditModifyJoin:h=الانضمام الى النص
ActionEditModifyJoin=&دمج
ActionEditModifyLineWrap:h=لف السطور مع العرض
ActionEditModifyLineWrap=&التفاف السطر
ActionEditModifySplit:h=تقسيم النص
ActionEditModifySplit=&تقسيم
ActionEditMove=نقل
ActionEditMoveLineDown:h=نقل السطر للاسفل
ActionEditMoveLineDown:s=Shift+Ctrl+Down
ActionEditMoveLineDown=&سطر للاسفل
ActionEditMoveLineUp:h=نقل السطر للاعلى
ActionEditMoveLineUp:s=Shift+Ctrl+Up
ActionEditMoveLineUp=&سطر للاعلى
ActionEditMoveNextWord:t=Translation needed
ActionEditMoveNextWord:h=Move to next word
ActionEditMoveNextWord:s=Ctrl+Right
ActionEditMoveNextWord=Next word
ActionEditMovePreviousWord:t=Translation needed
ActionEditMovePreviousWord:h=Move to previous word
ActionEditMovePreviousWord:s=Ctrl+Left
ActionEditMovePreviousWord=Previous word
ActionEditMoveSelectionDown:h=نقل التحديد للاسفل
ActionEditMoveSelectionDown:s=Shift+Alt+Down
ActionEditMoveSelectionDown=&تحديد اسفل
ActionEditMoveSelectionLeft:h=نقل التحديد اليسار
ActionEditMoveSelectionLeft:s=Shift+Alt+Left
ActionEditMoveSelectionLeft=&تحديد اليسار
ActionEditMoveSelectionRight:h=نقل التحديد لليمين
ActionEditMoveSelectionRight:s=Shift+Alt+Right
ActionEditMoveSelectionRight=&تحديد اليمين
ActionEditMoveSelectionUp:h=نقل التحديد لاعلى
ActionEditMoveSelectionUp:s=Shift+Alt+Up
ActionEditMoveSelectionUp=&تحديد اعلى
ActionEditPaste:h=ادخال محتويات ذاكرة النصوص
ActionEditPaste:s=Ctrl+V
ActionEditPaste=&لصق
ActionEditRedo:h=اعد العمل السابق
ActionEditRedo:s=Shift+Ctrl+Z
ActionEditRedo=&استعادة
ActionEditSelectAll:h=تحديد الكل
ActionEditSelectAll:s=Ctrl+A
ActionEditSelectAll=&تحديد الكل
ActionEditSort=&الفرز
ActionEditSortAsc:h=فرز تصاعدي
ActionEditSortAsc:s=Shift+Ctrl+A
ActionEditSortAsc=&تصاعدي
ActionEditSortDesc:h=فرز تنازلي
ActionEditSortDesc:s=Shift+Ctrl+D
ActionEditSortDesc=&تنازلي
ActionEditSortRandom:h=فرز عشوائي
ActionEditSortRandom=&عشوائية
ActionEditToggleCase:h=تثبيت الكشف
ActionEditToggleCase:s=Shift+Ctrl+C
ActionEditToggleCase=&تبديل الحالة
ActionEditToggleCaseAlternating:h=تثبيت كشف التناوب
ActionEditToggleCaseAlternating=التناوب
ActionEditToggleCaseLower:h=تثبيت كشف الواطئ
ActionEditToggleCaseLower:s=Ctrl+L
ActionEditToggleCaseLower=واطئ
ActionEditToggleCaseSentence:h=تثبيت كشف الجملة
ActionEditToggleCaseSentence=الجملة
ActionEditToggleCaseTitle:h=تثبيت كشف العنوان
ActionEditToggleCaseTitle=العنوان
ActionEditToggleCaseUpper:h=تثبيت كشف العالي
ActionEditToggleCaseUpper:s=Ctrl+U
ActionEditToggleCaseUpper=عالي
ActionEditTrim:t= الترجمة المطلوبة
ActionEditTrim=تشذيب
ActionEditTrimBoth:t= الترجمة المطلوبة
ActionEditTrimBoth:h=تشذيب اليسار واليمين
ActionEditTrimBoth=&كلاهما
ActionEditTrimLeft:t= الترجمة المطلوبة
ActionEditTrimLeft:h=تشذيب اليسار
ActionEditTrimLeft=&اليسار
ActionEditTrimRight:t= الترجمة المطلوبة
ActionEditTrimRight:h=تشذيب اليمين
ActionEditTrimRight=&اليمين
ActionEditUndo:h=الغاء الحدث الاخير
ActionEditUndo:s=Ctrl+Z
ActionEditUndo=&تراجع
ActionFile=&ملف
ActionFileCanClose:h=تبديل ما اذا كان يمكن اغلاق التبويب ام لا
ActionFileCanClose=يمكن ان تغلق
ActionFileClose=&اغلاق
ActionFileCloseActive:h=اغلاق المستند النشط
ActionFileCloseActive:s=Ctrl+F4
ActionFileCloseActive=&نشط
ActionFileCloseAll:h=اغلاق كل الملفات
ActionFileCloseAll=&الكل
ActionFileCloseAllOther:h=اغلق كل الصفحات الاخرى
ActionFileCloseAllOther:s=Shift+Ctrl+F4
ActionFileCloseAllOther=&كل الاخرى
ActionFileCloseModified:h=اغلق الملفات المعدلة
ActionFileCloseModified=&المعدلة
ActionFileCloseSelected:t= الترجمة المطلوبة
ActionFileCloseSelected:h=اغلاق الملفات المحددة
ActionFileCloseSelected=&المحدد
ActionFileCloseUnmodified:h=اغلق الملفات غير المعدلة
ActionFileCloseUnmodified=&غير المعدلة
ActionFileExit:h=اخرج من البرنامج
ActionFileExit:s=Alt+F4
ActionFileExit:s2=ESC
ActionFileExit=&خروج
ActionFileHTMLExport:h=HTML تصدير
ActionFileHTMLExport=تصدير HTML
ActionFileInfo:h=معلومات حول الملف النشط
ActionFileInfo=معلومة
ActionFileNew:h=انشئ مستند جديد
ActionFileNew:s=Ctrl+N
ActionFileNew=&جديد
ActionFileOpen:h=افتح مستند موجود
ActionFileOpen:s=Ctrl+O
ActionFileOpen=&افتح...
ActionFileOpenCommandPrompt:h=فتح موجه الاوامر
ActionFileOpenCommandPrompt=موجه الامر
ActionFileOpenFileExplorer:h=فتح ملف المستكشف
ActionFileOpenFileExplorer=مستكشف الملفات
ActionFileOpenInBrowser:h=اظهر المستند الحالي في المتصفح الافتراضي
ActionFileOpenInBrowser:s=Alt+B
ActionFileOpenInBrowser=&اظهر في المتصفح
ActionFilePrint:h=اطبع مستند نشط
ActionFilePrint:s=Ctrl+P
ActionFilePrint=&طباعة...
ActionFilePrintPreview:h=عرض المستند النشط
ActionFilePrintPreview=&عرض الطابعة...
ActionFileProperties:h=شاهد خصائص الملف
ActionFileProperties=&الخصائص...
ActionFileReadOnly:h=محرر التبديل للقراءة فقط
ActionFileReadOnly=للقراءة فقط
ActionFileReloadAutomatically:t= الترجمة المطلوبة
ActionFileReloadAutomatically:h=تبديل اعادة تحميل المحرر تلقائيا
ActionFileReloadAutomatically=اعادة التحميل تلقائيا
ActionFileReopenProperties=&الخصائص ...
ActionFileSave:h=حفظ المستند النشط
ActionFileSave:s=Ctrl+S
ActionFileSave=&حفظ
ActionFileSaveAll:h=حفظ كل المستندات
ActionFileSaveAll:s=Shift+Alt+S
ActionFileSaveAll=حفظ الكل
ActionFileSaveAs:h=حفظ المستند النشط باسم جديد
ActionFileSaveAs:s=Ctrl+Alt+S
ActionFileSaveAs=حفظ باسم...
ActionFileSelectFromDirectory:h=اختر من المجلد النشط
ActionFileSelectFromDirectory=اختر من المجلد
ActionGotoNextBookmark:h=انتقل الى الاشارة المرجعية التالية
ActionGotoNextBookmark:s=F2
ActionGotoNextBookmark=&التالي
ActionGotoPreviousBookmark:h=انتقل الى الاشارة المرجعية السابقة
ActionGotoPreviousBookmark:s=Shift+F2
ActionGotoPreviousBookmark=&السابق
ActionHelp=&التعليمات
ActionHelpAboutTextEditorPro:h=عرض معلومات عن البرنامج
ActionHelpAboutTextEditorPro=&Text Editor Pro حول
ActionHelpCheckForUpdates:h=التحقق من التحديثات
ActionHelpCheckForUpdates=&التدقيق على التحديثات
ActionHelpSendFeedback:h=ارسال ملاحظات الى info@texteditor.pro
ActionHelpSendFeedback=ارسال ملاحظات الى
ActionHelpShortcuts:h=اظهار اختصارات لوحه المفاتيح
ActionHelpShortcuts:s=Ctrl+F1
ActionHelpShortcuts=اختصارات
ActionHelpVisitHomepage:h=زيارة Text Editor Pro الصفحة الرسمية - http://texteditor.pro
ActionHelpVisitHomepage=&زيارة الموقع الرسمي
ActionToolsMacro=المختصر
ActionToolsMacroOpen:h=افتح مع اختصار جديد
ActionToolsMacroOpen=&افتح مجلد...
ActionToolsMacroPause:h=توقيف مؤقت للمختصر
ActionToolsMacroPause:s=Shift+Ctrl+R
ActionToolsMacroPause=&توقف
ActionToolsMacroPlayback:h=اعادة المختصر
ActionToolsMacroPlayback:s=Shift+Ctrl+P
ActionToolsMacroPlayback=&اعادة
ActionToolsMacroRecord:h=تسجيل المختصر
ActionToolsMacroRecord:s=Shift+Ctrl+R
ActionToolsMacroRecord=&تسجيل
ActionToolsMacroSaveAs:h=احفظ المختصر مع اسم جديد
ActionToolsMacroSaveAs=&احفظ باسم...
ActionToolsMacroStop:h=ايقاف تسجيل المختصر
ActionToolsMacroStop:s=Shift+Ctrl+S
ActionToolsMacroStop=&ايقاف
ActionMenuEdit:h=تغيير لتحرير صفحه القائمة
ActionMenuFile:h=تغيير الى صفحه قائمه الملفات
ActionMenuHelp:h=التغيير الى تعليمات صفحة القائمة
ActionMenuSearch:h=التغيير الى صفحة قائمة البحث
ActionMenuTools:h=التغيير الى صفحة قائمة الادوات
ActionMenuView:h=التغيير لعرض صفحة القائمة
ActionOpenColorTheme:h=فتح قائمة موضوع لون شريط العنوان
ActionOpenColorTheme:s=Alt+F11
ActionOpenColorTheme=لون الثيم
ActionOpenEncoding:h=فتح قائمة ترميز شريط العنوان
ActionOpenEncoding:s=Alt+F9
ActionOpenEncoding=ترميز
ActionOpenFileList:h=فتح قائمة ملف شريط العنوان
ActionOpenFileList:s=Alt+F12
ActionOpenFileList=ملفات
ActionOpenHighlighter:h=افتح قائمة تمييز شريط العناوين
ActionOpenHighlighter:s=Alt+F10
ActionOpenHighlighter=مميز
ActionOutputClose=&اغلاق
ActionOutputCloseActive:h=اغلق الصفحة الحالية
ActionOutputCloseActive=نشط
ActionOutputCloseAll:h=اغلق كل الصفحات
ActionOutputCloseAll=اغلاق الكل
ActionOutputCloseAllOtherPages:h=اغلق الكل
ActionOutputCloseAllOtherPages=اغلق كل الصفحات الاخرى
ActionOutputCloseSelected:t= الترجمة المطلوبة
ActionOutputCloseSelected:h=اغلاق المحدد
ActionOutputCloseSelected=&المحدد
ActionOutputCollapseAll:h=&طي الكل
ActionOutputCollapseAll=طي الكل
ActionOutputCopyAllToClipboard:h=انسخ الكل لذاكرة النصوص
ActionOutputCopyAllToClipboard=انسخ الكل لذاكرة النصوص
ActionOutputCopySelectedToClipboard:h=استنساخ المحدد لذاكرة النصوص
ActionOutputCopySelectedToClipboard=انسخ المحدد لذاكرة النصوص
ActionOutputExpandAll:h=توسيع الكل
ActionOutputExpandAll=توسيع الكل
ActionOutputOpenAll:h=فتح كل الملفات
ActionOutputOpenAll=&فتح الكل
ActionOutputOpenSelected:h=فتح الملفات المحددة
ActionOutputOpenSelected=&فتح المحدد
ActionOutputRefresh=انعاش
ActionOutputSelectAll:h=حدد كل الملفات
ActionOutputSelectAll=تحديد الكل
ActionOutputUnselectAll:h=الغاء تحديد كل الملفات
ActionOutputUnselectAll=الغاء تحديد الكل
ActionSearch=&البحث
ActionSearchMatchCase:h=حساسية الموضوع
ActionSearchMatchCase=حساسية الموضوع
ActionSearchClearBookmarks:h=مسح كل العلامات المرجعية
ActionSearchClearBookmarks=مسح العلامات
ActionSearchClose:h=&اغلاق
ActionSearchClose=حساسية الموضوع
ActionSearchEngine:h=حدد محرك البحث
ActionSearchEngine=حدد محرك البحث
ActionSearchFindAll:h=البحث عن كل النصوص المطابقة
ActionSearchFindAll:s=Alt+Enter
ActionSearchFindAll=بحث الكل
ActionSearchFindDuplicates:h=البحث عن التكرارات
ActionSearchFindDuplicates=البحث عن التكرارات
ActionSearchFindInFiles:h=ابحث عن سلاسل في الملفات المتعددة
ActionSearchFindInFiles:s=Shift+Ctrl+F
ActionSearchFindInFiles=&اوجد في الملفات...
ActionSearchFindNext:h=اوجد النص المتطابق مع النص
ActionSearchFindNext:s=F3
ActionSearchFindNext=&اوجد التالي
ActionSearchFindPrevious:h=جد السابق المتطابق مع النص
ActionSearchFindPrevious:s=Shift+F3
ActionSearchFindPrevious=&اوجد السابق
ActionSearchGoToBookmarks:h=اذهب الى العلامات المرجعية
ActionSearchGoToBookmarks=اذهب الى العلامات
ActionSearchGoToLine:h=اذهب الى السطر
ActionSearchGoToLine:s=Ctrl+G
ActionSearchGoToLine=اذهب للتخطيط
ActionSearchInSelection:h=في الاختيار
ActionSearchInSelection=في الاختيار
ActionSearchOptions:h=خيارات البحث
ActionSearchOptions=خيارات البحث
ActionSearchReplace:h=استبدل النص الموجود بنص اخر
ActionSearchReplace:s=Ctrl+R
ActionSearchReplace=&استبدل...
ActionSearchSearchButton:h=ابحث عن النص المطلوب
ActionSearchSearchButton:s=Ctrl+F
ActionSearchSearchButton=&بحث...
ActionSearchSpellCheck:h=التدقيق الاملائي
ActionSearchSpellCheck:s=F6
ActionSearchSpellCheck=التدقيق الاملائي
ActionSearchSpellCheckNextError:h=خطا التدقيق الاملائي التالي
ActionSearchSpellCheckNextError:s=Ctrl+F6
ActionSearchSpellCheckNextError=الخطا التالي
ActionSearchSpellCheckPreviousError:h=خطا التدقيق الاملائي السابق
ActionSearchSpellCheckPreviousError:s=Ctrl+Shift+F6
ActionSearchSpellCheckPreviousError=الخطا السابق
ActionSearchTextItems:t= الترجمة المطلوبة
ActionSearchTextItems:h=العناصر التي تم البحث عنها
ActionSearchTextItems=العناصر التي تم البحث عنها...
ActionSearchToggleBookmark:h=اعداد او مسح العلامة في السطر الحالي. العلامات يمكن اعداداها ايضا ب by using Ctrl+Shift+1..9. اذهب الى العلامات Ctrl+1..9.
ActionSearchToggleBookmark:s=Ctrl+F2
ActionSearchToggleBookmark=&تبديل الاشارة المرجعية
ActionSearchToggleBookmarks:h=تثبيت العلامات المرجعية
ActionSearchToggleBookmarks=&تبديل الاشارات المرجعية
ActionSearchWholeWords:h=الكلمات الكاملة فقط
ActionSearchWholeWords=الكلمات الكاملة فقط
ActionToolbarMenuLanguage=&اللغة
ActionToolbarMenuLayout=&النسق
ActionToolbarMenuLayoutSingle=&عمود
ActionToolbarMenuLayoutThreeColumns=&ثلاثة اعمدة
ActionToolbarMenuLayoutTwoColumns=&عمودين
ActionToolbarMenuSkin=&الغلاف...
ActionToolbarMenuView=&العرض
ActionTools=&الادوات
ActionToolsCharacterMap:h=ادخال رموز تشفير للمستند النشط بواسطة النقر المزدوج
ActionToolsCharacterMap=&لوحة الرموز المشفرة...
ActionToolsClipboardHistory:h=سجل الحافظة
ActionToolsClipboardHistory=سجل الحافظة
ActionToolsConvert:h=تحويل بين الوحدات الرقمية
ActionToolsConvert=المحول...
ActionToolsExecute:h=تنفيذ التطبيقات المخصصة
ActionToolsExecute=تنفيذ
ActionToolsExecuteConfigure:h=تكوين خصائص التنفيذ
ActionToolsExecuteConfigure=&تهيئة...
ActionToolsLanguageEditor:h=محرر اللغة
ActionToolsLanguageEditor=&محرر اللغة...
ActionToolsMagnifier:h=&المكبر
ActionToolsMagnifier=&المكبر
ActionToolsMagnifierBorderStyle:h=&نمط الحدود
ActionToolsMagnifierBorderStyle=&نمط الحدود
ActionToolsMagnifierBorderStyleDefault:h=نمط الحدود الافتراضي
ActionToolsMagnifierBorderStyleDefault=&افتراضي
ActionToolsMagnifierBorderStyleFlat:h=نمط الحدود شقة
ActionToolsMagnifierBorderStyleFlat=&مسطحة
ActionToolsMagnifierBorderStyleNone:h=ليس لها حدود
ActionToolsMagnifierBorderStyleNone=&لاشئ
ActionToolsMagnifierClose:h=اغلاق المكبر
ActionToolsMagnifierClose:s=خروج
ActionToolsMagnifierClose=&اغلاق
ActionToolsMagnifierScaling:h=&تدريج
ActionToolsMagnifierScaling=&تدريج
ActionToolsMagnifierScaling16x:h=التدرج ستة عشر مرة
ActionToolsMagnifierScaling16x=16x
ActionToolsMagnifierScaling2x:h=التدرج المزدوجة
ActionToolsMagnifierScaling2x=2x
ActionToolsMagnifierScaling4x:h=التدرج الرباعي
ActionToolsMagnifierScaling4x=4x
ActionToolsMagnifierScaling8x:h=التدرج ثماني مرات
ActionToolsMagnifierScaling8x=8x
ActionToolsMagnifierStyle:h=&نمط
ActionToolsMagnifierStyle=&نمط
ActionToolsMagnifierStyleLens:h=نمط العدسة
ActionToolsMagnifierStyleLens=&عدسة
ActionToolsMagnifierStyleRectangle:h=مستطيل الاسلوب
ActionToolsMagnifierStyleRectangle=&مستطيل
ActionToolsOptions:h=اعدادات الخيارات
ActionToolsOptions=&الاختيارات...
ActionToolsSelectForTextCompare:h=اختر مستند للمقارنة
ActionToolsSelectForTextCompare=اختر للموازنة...
ActionToolsPauseSpeaking:t= الترجمة المطلوبة
ActionToolsPauseSpeaking:h=&توقف عن الكلام
ActionToolsPauseSpeaking=&توقف عن الكلام
ActionToolsSpeech:t= الترجمة المطلوبة
ActionToolsSpeech=&الكلام
ActionToolsStartSpeaking:t= الترجمة المطلوبة
ActionToolsStartSpeaking:h=&ابدا بالتحدث
ActionToolsStartSpeaking=&ابدا بالتحدث
ActionToolsStopSpeaking:t= الترجمة المطلوبة
ActionToolsStopSpeaking:h=&توقف عن الكلام
ActionToolsStopSpeaking=&توقف عن الكلام
ActionToolsTextCompare:h=قارن الملفات
ActionToolsTextCompare=&موازنة الملفات..
ActionView=&العرض
ActionViewColorThemeSelection:h=اظهار او اخفاء محدد اللون
ActionViewColorThemeSelection=&اللون
ActionViewDirectory=الدليل
ActionViewDirectoryClose:h=اغلق المجلد النشط
ActionViewDirectoryClose:s=Shift+Alt+X
ActionViewDirectoryClose=&اغلق المجلد
ActionViewDirectoryEdit:h=تعديل المجلد النشط
ActionViewDirectoryEdit:s=Shift+Ctrl+E
ActionViewDirectoryEdit=&تعديل المجلد...
ActionViewDirectoryOpen:h=افتح مجلد جديد
ActionViewDirectoryOpen:s=Ctrl+D
ActionViewDirectoryOpen=&افتح مجلد...
ActionViewDirectoryVisibility:h=اخفاء او اظهرا المجلد
ActionViewDirectoryVisibility=&المجلد
ActionViewEncodingSelection:h=اظهار او اخفاء محدد التشفير
ActionViewEncodingSelection=&التشفير
ActionViewFiles:h=ابحث عن ملفات في المجلد وتفرعاته
ActionViewFiles:s=Ctrl+F12
ActionViewFiles=&الملفات...
ActionViewFolding=للطي
ActionViewFoldingCollapse=الطي
ActionViewFoldingCollapseAll:h=&انهيار كل
ActionViewFoldingCollapseAll=&طي الكل
ActionViewFoldingCollapseAllDownFromActiveLine:h=&طي الكل اسفل من السطر النشط
ActionViewFoldingCollapseAllDownFromActiveLine=&طي الكل اسفل من السطر النشط
ActionViewFoldingCollapseAllUpFromActiveLine:h=&تصغير الكل من السطر النشط
ActionViewFoldingCollapseAllUpFromActiveLine=&تصغير الكل من السطر النشط
ActionViewFoldingCollapseLine:h=&تصغير السطر
ActionViewFoldingCollapseLine:s=Alt+Left
ActionViewFoldingCollapseLine=&تصغير السطر
ActionViewFoldingExpand=موسع
ActionViewFoldingExpandAll:h=&توسيع الكل
ActionViewFoldingExpandAll=&توسيع الكل
ActionViewFoldingExpandAllDownFromActiveLine:h=&توسيع الكل اسفل من السطر النشط
ActionViewFoldingExpandAllDownFromActiveLine=&توسيع الكل اسفل من السطر النشط
ActionViewFoldingExpandAllUpFromActiveLine:h=&توسيع الكل ما يصل من سطر النشط
ActionViewFoldingExpandAllUpFromActiveLine=&توسيع الكل ما يصل من سطر النشط
ActionViewFoldingExpandLine:h=&توسيع السطر
ActionViewFoldingExpandLine:s=Alt+Right
ActionViewFoldingExpandLine=&توسيع السطر
ActionViewFoldingNext:h=الانتقال الى الطي التالي
ActionViewFoldingNext:s=Alt+Down
ActionViewFoldingNext=&التالي
ActionViewFoldingPrevious:h=الانتقال الى الطي السابق
ActionViewFoldingPrevious:s=Alt+Up
ActionViewFoldingPrevious=&السابق
ActionViewFullScreen:h=تبديل الشاشة الكاملة
ActionViewFullScreen:s=F11
ActionViewFullScreen=شاشة كاملة
ActionViewHexEditor:h=اظهار او اخفاء المحرر هيكس hex editor
ActionViewHexEditor:s=Ctrl+H
ActionViewHexEditor=محرر الهيكس
ActionViewHighlighterSelection:h=اخفاء او اظهار  الشفافية المحددة
ActionViewHighlighterSelection=&الشفافية
ActionViewLineNumbers:h=تبديل ارقام السطر
ActionViewLineNumbers=ارقام السطر
ActionViewMainMenu:h=اخفاء او اظهار القائمة
ActionViewMainMenu=&القائمة الرئيسية
ActionViewMenuBar:h=اخفاء او اظهار شريط القائمة
ActionViewMenuBar=&شريط القائمة
ActionViewMiniMap:h=اخفاء او اظهار الخريطة المصغرة
ActionViewMiniMap=خريطة مضغرة
ActionViewNextPage:h=اذهب الى الصفحة التالية
ActionViewNextPage:s=Ctrl+Tab
ActionViewNextPage=&الصفحة التالية
ActionViewOutput:h=اخفاء او اظهار المخرج
ActionViewOutput=&المخرج
ActionViewPreviousPage:h=اذهب الى الصفحة السابقة
ActionViewPreviousPage:s=Shift+Ctrl+Tab
ActionViewPreviousPage=&الصفحة السابقة
ActionViewRuler:h=اظهار او اخفاء المسطرة
ActionViewRuler=مسطرة
ActionViewSelectionMode:h=تثبيت وضع التحديد. وايضا اضغط على Alt والمحرر سوف يثبت وضع التحديد.
ActionViewSelectionMode=وضع التحديد
ActionViewSkinSelector=&محدد الجلد
ActionViewSpecialChars:h=تثبيت رموز خاصة
ActionViewSpecialChars=&رموز خاصة
ActionViewSplit:h=شذب المستند
ActionViewSplit=&شذب
ActionViewSplitHorizontal:h=انقسام افقي
ActionViewSplitHorizontal=&افقي
ActionViewSplitVertical:h=انقسام عمودي
ActionViewSplitVertical=&عمودي
ActionViewStatusBar:h=اظهار او اخفاء شريط الحالة
ActionViewStatusBar=&شريط الحالة
ActionViewSyncEdit:h=اظهار او اخفاء مزامنة العديل
ActionViewSyncEdit:s=Shift+Ctrl+J
ActionViewSyncEdit=مزامنة التعديل
ActionViewTitleBar=&شريط العنوان
ActionViewTitleBarFileList:h=اظهار او اخفاء ملف القائمة من شريط العنان
ActionViewTitleBarFileList=&ملف القائمة
ActionViewTitleBarFilename:h=اظههار او اخفاء اسم الملف من شريط العنوان
ActionViewTitleBarFilename=&اسم الملف
ActionViewTitleBarMagnifier:t= الترجمة المطلوبة
ActionViewTitleBarMagnifier= المكبر
ActionViewToolbar:h=اظهار او اخفاء شريط الادوات
ActionViewToolbar=&شريط الادوات
ActionViewWordWrap:h=تبديل حالة التواء الكلمة
ActionViewWordWrap=&التواء الكلمة
ActionViewXMLTree:h=اظهار او اخفاء XML تفرعات
ActionViewXMLTree=&XML تفرع
ActionXMLTreeRefresh:h=انعاش XML تفرع
ActionXMLTreeRefresh=&انعاش

[Message]
CannotFindString=لايمكن ايجاد السلسلة "%s"
DuplicatesWereNotFound=لم يتم العثور على التكرارات
LatestVersion=انت تستخدم اخر اصدار.
NoDefaultPrinter=لاتوجد طابعة محددة يرجى التحديد.
SelectFilePathFromDirectory=حدد مسار الملف من المجلد

[OptionsApplicationFrame]
CheckBoxAddApplicationInOpentWithContextMenu:t= الترجمة المطلوبة
CheckBoxAddApplicationInOpentWithContextMenu='اضافة تطبيق في قائمة السياق 'فتح باستخدام
CheckBoxAllowMultipleInstances:t= الترجمة المطلوبة
CheckBoxAllowMultipleInstances=السماح بمثيلات متعددة
CheckBoxAskToReloadModifiedFiles:t= الترجمة المطلوبة
CheckBoxAskToReloadModifiedFiles=اطلب اعادة التحميل
CheckBoxCheckForUpdatesAtStartup=التحقق من وجود تحديثات عند بدء التشغيل
CheckBoxCheckForUpdatesWhenClosing=التحقق من وجود تحديثات عند الاغلاق
CheckBoxClipboardHistoryEnabled=مفعل
CheckBoxCloseMinimizes=اغلاق التقليل
CheckBoxDropFiles=ملقات الاسقاط
CheckBoxEnableSkinEngine:t= الترجمة المطلوبة
CheckBoxEnableSkinEngine=تمكين محرك الجلد
CheckBoxMinimizeToSystemTray=تصغير الى علبه النظام
CheckBoxMoveCaretAtTheEnd:t= الترجمة المطلوبة
CheckBoxMoveCaretAtTheEnd=حرك علامة الاقحام في النهاية بعد اعادة التحميل
CheckBoxReloadAutomaticallyModifiedFiles:t= الترجمة المطلوبة
CheckBoxReloadAutomaticallyModifiedFiles=اعادة التحميل تلقائيا
GroupBoxClipboardHistory:t= الترجمة المطلوبة
GroupBoxClipboardHistory=تاريخ الحافظة
GroupBoxModifiedFiles:t= الترجمة المطلوبة
GroupBoxModifiedFiles=الملفات المعدلة
GroupBoxScaling:t= الترجمة المطلوبة
GroupBoxScaling=القياس
RadioButtonAuto:t= الترجمة المطلوبة
RadioButtonAuto=تلقائي
RadioButtonPercent:t= الترجمة المطلوبة
RadioButtonPercent=نسبه مئويه
RadioButtonPixelsPerInch:t= الترجمة المطلوبة
RadioButtonPixelsPerInch=بكسل لكل بوصة
SpinEditClipboardHistoryItemsCount:t= الترجمة المطلوبة
SpinEditClipboardHistoryItemsCount=عدد العناصر

[OptionsDirectoryFrame]
CheckBoxAutoHide=اخفاء تلقائي
CheckBoxShowArchiveFiles=اظهر الملفات المضغوطة
CheckBoxShowHiddenFiles=اظهر الملفات المخفية
CheckBoxShowOverlayIcons=عرض ايقونات الغطاء
CheckBoxShowSystemFiles=اظهر ملفات النظام
CheckBoxShowTreeLines=اظهر تفرعات الاسطر
CheckBoxUseExplorerTheme=استخدام موضوع المستكشف
ComboBoxAlign=الصف
SpinEditIndent=القطع
SpinEditMargin=حافة

[OptionsDirectoryTabsFrame]
CheckBoxBoldActiveTab:t= الترجمة المطلوبة
CheckBoxBoldActiveTab= علامة تبويب نشطة غامقة
CheckBoxCloseTabByDblClick=اغلاق التبويب بالضغط المزدوج
CheckBoxCloseTabByMiddleClick=اغلاق التبويب بضغط الوسط
CheckBoxEnlargeActiveTab:t= الترجمة المطلوبة
CheckBoxEnlargeActiveTab=تكبير التبويب النشطة
CheckBoxMultiline=سطر متعدد
CheckBoxRightClickSelect=اختر الزر الايمن
CheckBoxSaveTabs=حفظ التبويب
CheckBoxShowIcon=اظهر الصورة
CheckBoxShowOpenDirectoryButton=اظهر زر فتح المجلد
ComboBoxShowCloseButton=اظهر زر الاغلاق
GroupBoxFont=الخط
GroupBoxFontSize=حجم الخط
RadioButtonFontCustom:t= الترجمة المطلوبة
RadioButtonFontCustom=مخصص
RadioButtonFontDefault:t= الترجمة المطلوبة
RadioButtonFontDefault=افتراضي
RadioButtonFontSizeCustom:t= الترجمة المطلوبة
RadioButtonFontSizeCustom=مخصص
RadioButtonFontSizeDefault:t= الترجمة المطلوبة
RadioButtonFontSizeDefault=افتراضي
SpinEditTabHeight:t=Translation needed
SpinEditTabHeight=Height
SpinEditTabMargin:t=Translation needed
SpinEditTabMargin=Margin
SpinEditTabSpacing:t=Translation needed
SpinEditTabSpacing=Spacing

[OptionsEditorBackupFrame]
CheckBoxEnabled=مفعل
EditFileExtension:t= الترجمة المطلوبة
EditFileExtension=امتداد الملف
GroupBoxPath:t= الترجمة المطلوبة
GroupBoxPath=Path
GroupBoxSuffix:t= الترجمة المطلوبة
GroupBoxSuffix=لاحقة
RadioButtonPathCustom:t= الترجمة المطلوبة
RadioButtonPathCustom=مخصص
RadioButtonPathFile:t= الترجمة المطلوبة
RadioButtonPathFile=ملف
RadioButtonSuffixCounter:t= الترجمة المطلوبة
RadioButtonSuffixCounter=عداد
RadioButtonSuffixDateAndTime:t= الترجمة المطلوبة
RadioButtonSuffixDateAndTime=التاريخ و الوقت
RadioButtonSuffixNone:t= الترجمة المطلوبة
RadioButtonSuffixNone=لا شيئ

[OptionsEditorCaretFrame]
CheckBoxMultipleCaretsEnabled=مفعل
CheckBoxMultipleCaretsShowActiveLine=اظهار الخط النشط
CheckBoxMultipleCaretsShowGhost=عرض الشبح
CheckBoxNonblinkingCaretEnabled=مفعل
CheckBoxRightMouseClickMovesCaret=ضغط الزر الايمن لتحريك علامة الادخال
CheckBoxVisible=مرئي
ColorBoxNonblinkingCaretBackground=لون الخلفية
ColorBoxNonblinkingCaretForeground=لون المقدمة
ComboBoxStylesInsertCaret=ادخال
ComboBoxStylesOverwriteCaret=كتابة
GroupBoxMultipleCarets=الاقنعة المتعددة
GroupBoxNonBlinkingCaret=علامة ادخال بدون ترميش
GroupBoxStyles=الاسلوب

[OptionsEditorColorFrame]
ActionReset=اعادة تعيين
CheckBoxElementsAttributesBold=عريض
CheckBoxElementsAttributesItalic=مائل
CheckBoxElementsAttributesUnderline=اسفل الخط
CheckBoxSkinActiveLineBackground=خلفية السطر النشطة
CheckBoxSkinBackground=خلفية
CheckBoxSkinBookmarkPanelBackground=خلفية لوحة العلامات المرجعية
CheckBoxSkinCodeFoldingBackground=رمز خلفية قابلة للطي
CheckBoxSkinCodeFoldingHintBackground=رمز الطي تلميح الخلفية
CheckBoxSkinCompletionProposalBackground=انهاء الخلفية المقترحة
CheckBoxSkinCompletionProposalSelectionBackground=اكمال اختيار اقتراح الخلفية
CheckBoxSkinForeground=المقدمة
CheckBoxSkinLeftMarginBackground=خلفية الحافة اليسرى
CheckBoxSkinSelectionBackground=الخلفية المحددة
CheckBoxSkinSelectionForeground=المقدمة المحددة
ColorComboBoxEditorColor=&اللون
ColorComboBoxElementsBackground=خلفية
ColorComboBoxElementsForeground=المقدمة
ComboBoxColorTheme=الالوان
ComboBoxEditorElement=المواد
ComboBoxElementsName=الاسم
ComboBoxHighlighter=ضوء عالي
DateEditDate=التاريخ
EditEmail=البريد الالكتروني
EditName=الاسم
EditVersion=الاصدار
GroupBoxAttributes=الخواص
LabelSkinDescription=استخدم لون الغلاف للمواد المحددة
TabSheetAuthor=المؤلف
TabSheetEditor=المحرر
TabSheetElements=المواد
TabSheetGeneral=العام
TabSheetUseSkinColor=استخدم لون الغلاف

[OptionsEditorCompletionProposalFrame]
CheckBoxAddHighlighterKeywords=اضف كلمات اساسية للتمييز
CheckBoxAutoInvoke=استناد تلقائي
CheckBoxMatchCase=حالة الاحرف
CheckBoxParseWordsFromText=تحليل الكلمات من النص
CheckBoxEnabled=مفعل
ComboBoxShortcut=الاختصار
SpinEditNumberOfRows=عدد الصفوف

[OptionsEditorDefaultsFrame]
ComboBoxDefaultColor=&اللون
ComboBoxDefaultEncoding=&التشفير
ComboBoxDefaultHighlighter=الشفافية
ComboBoxDefaultSQLHighlighter=SQL شفافية
EditBrowser=التصفح

[OptionsEditorFoldingFrame]
CheckBoxExpandByHintClick=تمديدها من قبل تلميح نقرة
CheckBoxFoldMultilineComments=طوي ملاحظات السطور المتعددة
CheckBoxHighlightIndentGuides=ابرز خطوط ارشاد البادئة
CheckBoxHighlightMatchingPair=ابرز زوج متطابق
CheckBoxShowCollapsedCodeHint=اظهار تلميح رمز التشعب
CheckBoxShowCollapsedLine=اظهار تشعب السطر
CheckBoxShowCollapseMarkAtTheEnd=اظهار علامة الانهيار في النهاية
CheckBoxShowIndentGuides=اظهار خطوط ارشاد البادئة
CheckBoxShowTreeLine=اظهار خط الشجرة
CheckBoxTextFoldingEnabled=تمكين
CheckBoxVisible=مرئي
ComboBoxMarkStyle=اسلوب العلامة
GroupBoxCodeFolding=طي الكود
GroupBoxTextFileFolding=ملف نصي للطي
RadioButtonOutlinedByACharacter=الخطوط العريضة من قبل شخصية
RadioButtonOutlinedBySpacesAndTabs=الخطوط العريضة للمسافات وعلامات التبويب
SpinEditCollapsedRowCharacterCount=تم تصغير عدد الصفوف
SpinEditDelayInterval=(فاصل التاخر (بالميلي ثانية
SpinEditHintRowCount=تلميح احصاء الاسطر

[OptionsEditorFontFrame]
ActionReset=استعادة
ComboBoxColorTheme=&اللون
ComboBoxElement=المادة
FontComboBoxFont=الخط
SpinEditFontSize=حجم الخط

[OptionsEditorLeftMarginFrame]
CheckBoxAutoSize=حجم تلقائي
CheckBoxLineNumbersVisible=مرئي
CheckBoxShowAfterLastLine=اظهر بعد السطر الاخير
CheckBoxShowBookmarkPanel=اظهر لوحة العلامات المرجعية
CheckBoxShowBookmarks=اظهر العلامات المرجعية
CheckBoxShowInTens=اظهر بالعشرات
CheckBoxShowLeadingZeros=اظهر الاصفار الرئيسية
CheckBoxShowLineState=اظهر حالة السطر
CheckBoxVisible=مرئي
ColorComboBoxBookmarkLineColor=لون خط الاشارة المرجعية
GroupBoxLineNumbers=رقم السطر
SpinEditBookmarkPanelWidth=عرض لوحة العلامات المرجعية
SpinEditLineNumbersStartFrom=ابدء من
SpinEditWidth=العرض

[OptionsEditorMatchingPairFrame]
CheckBoxAutoComplete:t= الترجمة المطلوبة
CheckBoxAutoComplete=اكمال تلقائي
CheckBoxHighlightEnabled=مفعل
CheckBoxHighlightAfterToken=ابرز ما بعد المنطلق
CheckBoxHighlightUnmatched=ابرز ما لا نظير لها
GroupBoxDisplay=عرض
GroupBoxDisplay:t= الترجمة المطلوبة
GroupBoxHighlight:t== الترجمة المطلوبة
GroupBoxHighlight=تمييزر
RadioButtonHighlight=تمييز
RadioButtonUnderline=تسطير

[OptionsEditorMinimapFrame]
CheckBoxBlendingEnabled:t= الترجمة المطلوبة
CheckBoxBlendingEnabled=ممكن
CheckBoxBlendingInvert:t= الترجمة المطلوبة
CheckBoxBlendingInvert=عكس
CheckBoxShowBookmarks=اظهار الاشارات المرجعية
CheckBoxShowBorder=اظهار الحدود
CheckBoxShowIndentGuides=اظهار خطوط ارشاد البادئة
CheckBoxShowSearchResults=عرض نتائج البحث
CheckBoxShowSelection=عرض التحديد
CheckBoxShowShadow=اظهار الظل
CheckBoxVisible=مرئي
ComboBoxAlign=المحاذاة
GroupBoxBlending:t= الترجمة المطلوبة
GroupBoxBlending=مزج
SpinEditWidth=عرض

[OptionsEditorOptionsFrame]
CheckBoxAutoIndent=التلقائي
CheckBoxAutoSave=حفظ تلقائي
CheckBoxDragDropEditing=الاسقاط بالسحب ليتم تعديلها
CheckBoxGroupUndo=التراجع عن المجموعة
CheckBoxTrailingLineBreak=فاصل اسطر بعد السطر الاخير
CheckBoxTrimTrailingSpaces=تقليم المسافات الزائدة
CheckBoxUndoAfterSave=التراجع بعد حفظ
ComboBoxDefaultLineBreak=فاصل الاسطر الافتراضي
SpinEditLineSpacing=تباعد الاسطر
SpinEditMargin=الحافة

[OptionsEditorRightMarginFrame]
CheckBoxAutoLineBreak=الي فصل السطر
CheckBoxMouseMove=حركة الفارة
CheckBoxShowMovingHint=اظهر تلميح الحركة
CheckBoxVisible=مرئي
SpinEditPosition=الموقع

[OptionsEditorRulerFrame]
CheckBoxShowSelection=عرض التحديد
CheckBoxVisible=مرئي
SpinEditHeight=مرتفع

[OptionsEditorScrollFrame]
CheckBoxAutosizeMaxWidth=عرض الحجم تلقائي الاقصى
CheckBoxHalfPage=نصف الصفحة
CheckBoxHintFollows=تلميح التتبع
CheckBoxPastEndOfFile=لصق في نهايةالملف
CheckBoxPastEndOfLineMarker=النهاية السابقة من علامة السطر
CheckBoxShowHint=اظهار التلميح
CheckBoxShowHorizontalScrollBar=اظهار شريط التمرير الافقي
CheckBoxShowShadow=اظهار الظل
CheckBoxShowVerticalScrollBar=اظهار شريط التمرير العمودي

[OptionsEditorSearchFrame]
CheckBoxAutoCompleteEnabled=مفعل
CheckBoxBeepIfSearchStringNotFound=ملائمة اذا لم تكن سلاسل البحث موجودة
CheckBoxMatchCase:t= الترجمة المطلوبة
CheckBoxMatchCase=حالة المطابقة
CheckBoxClearWhenClosed=مسح عند الاغلاق
CheckBoxEntireScope=كامل المجال
CheckBoxFileSpecificSearch=ملف-بحث معين
CheckBoxFindWordAtCursor=البحث عن كلمة في المؤشر
CheckBoxHighlightResult=نتائج الابراز
CheckBoxSearchOnTyping=بحث بواسطة النوع
CheckBoxSearchOnTypingEnabled=مفعل
CheckBoxShowSearchMap=اظهار خريطة البحث
CheckBoxShowSearchMatchNotFound=اظهار تطابق البحث غير موجود
CheckBoxShowSearchStringNotFound=اظهار سلسلة البحث غير موجود
CheckBoxToggleSearchBar=تبديل شريط البحث
CheckBoxVisible=مرئي
CheckBoxWholeWords=الكلمات الكاملة فقط
CheckBoxWrapAround=التواء حول
ComboBoxSearchBarAlign=محاذاة شريط البحث
ComboBoxSearchMapAlign=المحاذاة
GroupBoxAutoComplete=اكمال تلقائي
GroupBoxSearchOnTyping:t= الترجمة المطلوبة
GroupBoxSearchOnTyping=البحث على الكتابة
SpinEditAutoCompleteDelayInterval:t= الترجمة المطلوبة
SpinEditAutoCompleteDelayInterval=(الفاصل الزمني للتاخير (م ث
SpinEditSearchOnTypingDelayInterval:t= الترجمة المطلوبة
SpinEditSearchOnTypingDelayInterval=(الفاصل الزمني للتاخير (م ث

[OptionsEditorSelectionFrame]
CheckBoxALTSetsColumnMode=ALT تعيين وضع العمود
CheckBoxAutoCopyToClipboard=نسخ تلقائي الى الحافظة
CheckBoxExpandRealNumbers=توسيع الاعداد الحقيقية
CheckBoxFromEndOfLine=من نهاية السطر
CheckBoxHighlightSimilarTerms=ابراز المصطلحات المشابهة
CheckBoxShowSelectionInfo:t= الترجمة المطلوبة
CheckBoxShowSelectionInfo=اظهار معلومات التحديد
CheckBoxTermsMatchCase=شروط حالة الاحرف
CheckBoxToEndOfLastLine=من نهاية السطر الاخير
CheckBoxToEndOfLine=الى نهاية السطر
CheckBoxTripleClickRowSelect=النقر الثلاثي فوق صف للاختيار
CheckBoxVisible=مرئي

[OptionsEditorSpecialCharsFrame]
CheckBoxLineBreakVisible=مرئي
CheckBoxSelectionVisible=مرئي
CheckBoxVisible=مرئي
ColorComboBoxLineBreakColor=&اللون
ColorComboBoxSelectionColor=&اللون
ComboBoxArrowStyle=الاسلوب
ComboBoxLineBreakStyle=الاسلوب
GroupBoxColor=لون
GroupBoxLineBreak=&اللون
GroupBoxSelection=الاختيار
RadioButtonCustomColor=استخدام اللون
RadioButtonMiddleColor=استخدام الالوان المتوسطة
RadioButtonTextColor=استخدام لون النص

[OptionsEditorSpellCheckFrame]
CheckBoxEnabled=ممكن
ComboBoxDictionary=القاموس

[OptionsEditorSyncEditFrame]
CheckBoxMatchCase=حالة الاحرف
CheckBoxEnabled=مفعل
CheckBoxShowActivateIcon=اظهار ايقونة التنشيط

[OptionsEditorTabsFrame]
CheckBoxBoldActiveTab:t= الترجمة المطلوبة
CheckBoxBoldActiveTab=علامة تبويب نشطة غامقة
CheckBoxCloseTabByDblClick=اغلق التبويب عن طريق النقر المزدوج
CheckBoxCloseTabByMiddleClick=اغلق التبويب عن طريق النقر بالزر الاوسط
CheckBoxDimReadOnlyWhenNotActive=قراءة خافتة فقط عندما لا تكون نشطة
CheckBoxEnlargeActiveTab:t= الترجمة المطلوبة
CheckBoxEnlargeActiveTab=تكبير التبويب النشطة
CheckBoxHideCloseButtonWhenCanCloseIsNotChecked=اخفاء زر الاغلاق عند الاغلاق الغير محدد
CheckBoxMultiline=متعدد
CheckBoxRightClickSelect=انقر بزر الماوس الايمن
CheckBoxSaveTabs=حفظ علامات التبويب
CheckBoxShowIcon=اظهر الصورة
CheckBoxShowNewFileButton=عرض زر ملف جديد
ComboBoxShowCloseButton=اظهار زر الاغلاق
GroupBoxFont=الخط
GroupBoxFontSize=حجم الخط
RadioButtonFontCustom:t= الترجمة المطلوبة
RadioButtonFontCustom=مخصص
RadioButtonFontDefault:t= الترجمة المطلوبة
RadioButtonFontDefault=افتراضي
RadioButtonFontSizeCustom:t= الترجمة المطلوبة
RadioButtonFontSizeCustom=مخصص
RadioButtonFontSizeDefault:t= الترجمة المطلوبة
RadioButtonFontSizeDefault=افتراضي
SpinEditTabHeight:t=Translation needed
SpinEditTabHeight=Height
SpinEditTabMargin:t=Translation needed
SpinEditTabMargin=Margin
SpinEditTabSpacing:t=Translation needed
SpinEditTabSpacing=Spacing

[OptionsEditorTabulatorFrame]
CheckBoxColumns=الاعمدة
CheckBoxPreviousLineIndent=سطر البادئة السابقة
CheckBoxSelectedBlockIndent=اختيارالبادئة المحضورة
CheckBoxTabsToSpaces=اضغط للمسافة
SpinEditWidth=عرض

[OptionsEditorWordWrapFrame]
CheckBoxVisible=مرئي
ComboBoxWidth=عرض

[OptionsFileTypesFrame]
EditExtensions=الاختصارات
VirtualDrawTree:0=نوع الملف

[OptionsForm]
ActionApplication=تطبيق
ActionCompare=مقارنة ملفات
ActionDirectory=المجلد
ActionDirectoryTabs=منظم الجداول
ActionEditor=محرر
ActionEditorBackup:t= الترجمة المطلوبة
ActionEditorBackup= نسخ احتياطي
ActionEditorCaret=علامة الاقحام
ActionEditorColors=الالوان
ActionEditorCompletionProposal=اكمال مشروع
ActionEditorDefaults=الافتراضي
ActionEditorFolding=رمز الطي
ActionEditorFonts=الخط
ActionEditorLeftMargin=الحد الايسر
ActionEditorMatchingPair=الزوج المطابق
ActionEditorMinimap=خريطة مصغرة
ActionEditorRightMargin=الحد الايمن
ActionEditorRuler=مسطرة
ActionEditorScroll=تدوير
ActionEditorSearch=البحث
ActionEditorSelection=التحديد
ActionEditorSpecialChars=رموز خاصة
ActionEditorSpellCheck=التدقيق الاملائي
ActionEditorSyncEdit=تعديل المزامنة
ActionEditorTabs=التبويبات
ActionEditorTabulator=منظم الجداول
ActionEditorWordWrap=التواء الكلمة
ActionFileTypes=انواع الملف
ActionHexEditor=محرر الهيكس
ActionMainMenu=القائمة الرئيسية
ActionMenuBar=شريط القوائم
ActionOpen:h=اكتب الخيارات في ملف INI
ActionOpen=فتح...
ActionOutput=الاخراج
ActionOutputTabs=التبويبات
ActionPrint=طباعة
ActionSaveAs:h=قراءة الخيارات من ملف INI
ActionSaveAs=حفظ باسم...
ActionSQLAlignments=الفرز
ActionSQLCapitalization=القيمة
ActionSQLFormatter=SQL صيغ
ActionSQLIndentation=القطع
ActionSQLInsert=ادخال
ActionSQLSelect=تحديد
ActionSQLUpdate=تحديث
ActionSQLWhitespace=الفضاء الابيض
ActionStatusBar=شريط الحالة
ActionTitleBar=شريط العنوان
ActionToolbar=شريط الادوات
ButtonCancel=الغاء الامر
ButtonOK=&موافق
Caption=الخيارات

[OptionsHexEditorFrame]
CheckBoxAutosize=تحجيم تلقائي
CheckBoxHexLowerCase=احرف صغيرة سداسية
CheckBoxShowRuler=عرض المسطرة
ComboBoxCaretStyle=اسلوب الاقحام

[OptionsMainMenuFrame]
SpinEditReopenCount=اعد فتح العد
GroupBoxFont=الخط
GroupBoxFontSize=حجم الخط
RadioButtonFontCustom:t= الترجمة المطلوبة
RadioButtonFontCustom=مخصص
RadioButtonFontDefault:t= الترجمة المطلوبة
RadioButtonFontDefault=افتراضي
RadioButtonFontSizeCustom:t= الترجمة المطلوبة
RadioButtonFontSizeCustom=مخصص
RadioButtonFontSizeDefault:t= الترجمة المطلوبة
RadioButtonFontSizeDefault=افتراضي

[OptionsMenuBarFrame]
ActionAddDivider:h=اضافة مقسم
ActionAddDivider=اضف مقسما
ActionAddButton:h=اضف مادة
ActionAddButton=اضف مادة
ActionDelete:h=حذف
ActionDelete=حذف
ActionMoveDown:h=حرك المادة المحدد للاسفل
ActionMoveDown=تحريك للاسفل
ActionMoveUp:h=حرك المادة المحدد للاعلى
ActionMoveUp=تحريك للاعلى
ActionReset:h=استعادة مواد القائمة
ActionReset=استعادة
CheckBoxBlended:t= الترجمة المطلوبة
CheckBoxBlended= ممزوج
CheckBoxBoldActiveTab:t= الترجمة المطلوبة
CheckBoxBoldActiveTab= علامة تبويب نشطة غامقة
CheckBoxEnlargeActiveTab:t= الترجمة المطلوبة
CheckBoxEnlargeActiveTab= تكبير التبويب النشطة
CheckBoxGrayed:t= الترجمة المطلوبة
CheckBoxGrayed= رمادي
CheckBoxReflected=انعكست
GroupBoxButtonsFont=الخط
GroupBoxButtonsFontSize=حجم الخط
GroupBoxDisabled:t= الترجمة المطلوبة
GroupBoxDisabled= معطل
GroupBoxIcons=الرموز
GroupBoxTabsFont=الخط
GroupBoxTabsFontSize=حجم الخط
RadioButtonButtonsFontCustom:t= الترجمة المطلوبة
RadioButtonButtonsFontCustom=مخصص
RadioButtonButtonsFontDefault:t= الترجمة المطلوبة
RadioButtonButtonsFontDefault=افتراضي
RadioButtonButtonsFontSizeCustom:t= الترجمة المطلوبة
RadioButtonButtonsFontSizeCustom=مخصص
RadioButtonButtonsFontSizeDefault:t= الترجمة المطلوبة
RadioButtonButtonsFontSizeDefault=افتراضي
RadioButtonLargeIcons=كبير
RadioButtonSmallIcons=صغير
RadioButtonTabsFontCustom:t= الترجمة المطلوبة
RadioButtonTabsFontCustom=مخصص
RadioButtonTabsFontDefault:t= الترجمة المطلوبة
RadioButtonTabsFontDefault=افتراضي
RadioButtonTabsFontSizeCustom:t= الترجمة المطلوبة
RadioButtonTabsFontSizeCustom=مخصص
RadioButtonTabsFontSizeDefault:t= الترجمة المطلوبة
RadioButtonTabsFontSizeDefault=افتراضي
SpinEditTabHeight:t=Translation needed
SpinEditTabHeight=Height
SpinEditTabMargin:t=Translation needed
SpinEditTabMargin=Margin
SpinEditTabPadding:t=Translation needed
SpinEditTabPadding=Padding
SpinEditTabSpacing:t=Translation needed
SpinEditTabSpacing=Spacing
TabSheetButtons=ازرار
TabSheetButtonOptions:t= الترجمة المطلوبة
TabSheetButtonOptions= خيارات الزر
TabSheetTabOptions:t= الترجمة المطلوبة
TabSheetTabOptions= خيارات الجدولة
TrackEditBlend:t= الترجمة المطلوبة
TrackEditBlend= المزيج
VirtualDrawTree:0=مواد القائمة
VirtualDrawTree:h=استخدم السحب والاسقاط لتحريك مواد القائمة. اضغط الزر الايمن لادخال وحذف المواد.

[OptionsOutputFrame]
CheckBoxShowCheckBox=اظهر صندوق التحقق
CheckBoxShowTreeLines=اظهر تفرع السطر
CheckBoxUseExplorerTheme=استخدام شكل المستكشف
SpinEditIndent=قطع
SpinEditMargin=حافة

[OptionsOutputTabsFrame]
CheckBoxBoldActiveTab:t= الترجمة المطلوبة
CheckBoxBoldActiveTab= علامة تبويب نشطة غامقة
CheckBoxCloseTabByDblClick=اغلق التبويب عن طريق النقر المزدوج
CheckBoxCloseTabByMiddleClick=اغلق التبويب عن طريق النقر بالزر الاوسط
CheckBoxEnlargeActiveTab:t= الترجمة المطلوبة
CheckBoxEnlargeActiveTab= تكبير التبويب النشطة
CheckBoxMultiline=سطرمتعدد
CheckBoxRightClickSelect=انقر بزر الماوس الايمن
CheckBoxSaveTabs=حفظ علامات التبويب
CheckBoxShowFindInFilesButton=اظهار البحث في زر الملفات
CheckBoxShowIcon=اظهر الصورة
ComboBoxShowCloseButton=اظهر زر الاغلاق
GroupBoxFont=الخط
GroupBoxFontSize=حجم الخط
RadioButtonFontCustom:t= الترجمة المطلوبة
RadioButtonFontCustom=مخصص
RadioButtonFontDefault:t= الترجمة المطلوبة
RadioButtonFontDefault=افتراضي
RadioButtonFontSizeCustom:t= الترجمة المطلوبة
RadioButtonFontSizeCustom=مخصص
RadioButtonFontSizeDefault:t= الترجمة المطلوبة
RadioButtonFontSizeDefault=افتراضي
SpinEditTabHeight:t=Translation needed
SpinEditTabHeight=Height
SpinEditTabMargin:t=Translation needed
SpinEditTabMargin=Margin
SpinEditTabSpacing:t=Translation needed
SpinEditTabSpacing=Spacing

[OptionsPrintFrame]
CheckBoxColorsEnabled=مفعل
CheckBoxLineNumbersInMargin:t= الترجمة المطلوبة
CheckBoxLineNumbersInMargin= على الهامش
CheckBoxLineNumbersVisible=مرئي
CheckBoxShowFooterLine=اظهر السطر الذيلي
CheckBoxShowHeaderLine=اظهر السطر الراسي
CheckBoxShowOnlyPageNumber:t= الترجمة المطلوبة
CheckBoxShowOnlyPageNumber=اظهار رقم الصفحة فقط
CheckBoxUseRomanNumerals:t= الترجمة المطلوبة
CheckBoxUseRomanNumerals= استخدم الارقام الرومانية
CheckBoxVisibleDateTime=مرئي
CheckBoxVisibleFilename=مرئي
CheckBoxVisiblePageNumber=مرئي
CheckBoxVisiblePrintedBy=مرئي
CheckBoxWordWrap=التواء الكلمة
ComboBoxColorTheme=لون الثيم
GroupBoxAlignmentDateTime:t= الترجمة المطلوبة
GroupBoxAlignmentDateTime= المحاذاة
GroupBoxAlignmentFilename:t= الترجمة المطلوبة
GroupBoxAlignmentFilename= المحاذاة
GroupBoxAlignmentPageNumber:t= الترجمة المطلوبة
GroupBoxAlignmentPageNumber= المحاذاة
GroupBoxAlignmentPrintedBy:t= الترجمة المطلوبة
GroupBoxAlignmentPrintedBy= المحاذاة
GroupBoxColors=الالوان
GroupBoxDateTime=وقت البيانات
GroupBoxFilename=اسم المستند
GroupBoxLineNumbers:t= الترجمة المطلوبة
GroupBoxLineNumbers= ارقام الاسطر
GroupBoxMargins:t= الترجمة المطلوبة
GroupBoxMargins= هوامش
GroupBoxPageNumber=رقم  الصفحة
GroupBoxPrintedBy=تم الطبع بواسطة
GroupBoxVerticalAlignmentDateTime:t= الترجمة المطلوبة
GroupBoxVerticalAlignmentDateTime= محاذاة عمودية
GroupBoxVerticalAlignmentFilename:t= الترجمة المطلوبة
GroupBoxVerticalAlignmentFilename= محاذاة عمودية
GroupBoxVerticalAlignmentPageNumber:t= الترجمة المطلوبة
GroupBoxVerticalAlignmentPageNumber= محاذاة عمودية
GroupBoxVerticalAlignmentPrintedBy:t= الترجمة المطلوبة
GroupBoxVerticalAlignmentPrintedBy= محاذاة عمودية
RadioButtonAlignmentLeftDateTime:t= الترجمة المطلوبة
RadioButtonAlignmentLeftDateTime= يسار
RadioButtonAlignmentLeftFilename:t= الترجمة المطلوبة
RadioButtonAlignmentLeftFilename= يسار
RadioButtonAlignmentLeftPageNumber:t= الترجمة المطلوبة
RadioButtonAlignmentLeftPageNumber= يسار
RadioButtonAlignmentLeftPrintedBy:t= الترجمة المطلوبة
RadioButtonAlignmentLeftPrintedBy= يسار
RadioButtonAlignmentRightDateTime:t= الترجمة المطلوبة
RadioButtonAlignmentRightDateTime= يمين
RadioButtonAlignmentRightFilename:t= الترجمة المطلوبة
RadioButtonAlignmentRightFilename= يمين
RadioButtonAlignmentRightPageNumber:t= الترجمة المطلوبة
RadioButtonAlignmentRightPageNumber= يمين
RadioButtonAlignmentRightPrintedBy:t= الترجمة المطلوبة
RadioButtonAlignmentRightPrintedBy= يمين
RadioButtonVerticalAlignmentFooterDateTime:t= الترجمة المطلوبة
RadioButtonVerticalAlignmentFooterDateTime= هامش
RadioButtonVerticalAlignmentFooterFilename:t= الترجمة المطلوبة
RadioButtonVerticalAlignmentFooterFilename= هامش
RadioButtonVerticalAlignmentFooterPageNumber:t= الترجمة المطلوبة
RadioButtonVerticalAlignmentFooterPageNumber= هامش
RadioButtonVerticalAlignmentFooterPrintedBy:t= الترجمة المطلوبة
RadioButtonVerticalAlignmentFooterPrintedBy= هامش
RadioButtonVerticalAlignmentHeaderDateTime:t= الترجمة المطلوبة
RadioButtonVerticalAlignmentHeaderDateTime= عنوان راسي
RadioButtonVerticalAlignmentHeaderFilename:t= الترجمة المطلوبة
RadioButtonVerticalAlignmentHeaderFilename= عنوان راسي
RadioButtonVerticalAlignmentHeaderPageNumber:t= الترجمة المطلوبة
RadioButtonVerticalAlignmentHeaderPageNumber= عنوان راسي
RadioButtonVerticalAlignmentHeaderPrintedBy:t= الترجمة المطلوبة
RadioButtonVerticalAlignmentHeaderPrintedBy= عنوان راسي
SpinEditMarginsBottom:t= الترجمة المطلوبة
SpinEditMarginsBottom= القاع
SpinEditMarginsLeft:t= الترجمة المطلوبة
SpinEditMarginsLeft= يسار
SpinEditMarginsRight:t= الترجمة المطلوبة
SpinEditMarginsRight= يمين
SpinEditMarginsTop:t= الترجمة المطلوبة
SpinEditMarginsTop=Top
TabSheetHeadedAndFooter:t= الترجمة المطلوبة
TabSheetHeadedAndFooter= عنوان راسي و الهامش
TabSheetOptions:t= الترجمة المطلوبة
TabSheetOptions=الخيارات

[OptionsSQLAlignmentsFrame]
CheckBoxKeywordAlignmentLeftJustify=محاذاة الكلمة اليسار التام
ComboBoxKeywordAlign=فرز الكلمات الدليلية

[OptionsSQLCapitalizationFrame]
ComboBoxAliasName=اللقب
ComboBoxColumnName=اسم العمود
ComboBoxDataType=نوع البيانات
ComboBoxFunctionName=اسم الوظيفة
ComboBoxIdentifier=المعرف
ComboBoxKeywords=كلمات دليلية
ComboBoxQuotedIdentifier=اداة  التعريف المقتبسة
ComboBoxTableName=اسم الجدول
ComboBoxVariableName=اسم القيم

[OptionsSQLFormatterFrame]
ComboBoxDatabase=قاعدة البيانات

[OptionsSQLIndentationFrame]
CheckBoxBlockOnNewLine=امنع سطر جديد
CheckBoxUseTab=استخدم مفتاح تنظيم الجدول
SpinEditBlockIndentSize=امنع حجم البادئة
SpinEditBlockLeftIndentSize=امنع حجم يسار البادئة
SpinEditBlockRightIndentSize=امنع حجم يمين البادئة
SpinEditFunctionBodyIndent=وظيفة هيكل البادئة
SpinEditIndentLength=طول القطع
SpinEditSingleStatementIndent=IF/ELSE بيان واحد حجم البادئة
SpinEditTabSize=حجم مفتاح تنظيم الجدول

[OptionsSQLInsertFrame]
CheckBoxParenthesisInSeparateLines=الاقواس في خطوط منفصلة
ComboBoxColumnListStyle=اسلوب عمود القائمة
ComboBoxValueListStyle=اسلوب قيمة القائمة
SpinEditInsertColumnsPerLine=ادخل اعمدة بين السطر

[OptionsSQLSelectFrame]
CheckBoxAlignAlias=محاذاة اللقب
CheckBoxAlignAliasInFromClause=FROM محاذاة اللقب في البند
CheckBoxAlignAndOrWithOnInJoinClause=محاذاة AND/OR مع ON في JOIN فقرة
CheckBoxAlignJoinWithFromKeyword=محاذاة الانضمام مع من الكلمة
CheckBoxAndOrUnderWhere=و / او بموجب اين
CheckBoxColumnInNewLine=الاعمدة في السطر الجديد
CheckBoxFromClauseInNewLine=FROM جملة في الخط الجديد
CheckBoxGroupByClauseInNewLine=GROUP BY جملة في الخط الجديد
CheckBoxHavingClauseInNewLine=HAVING جملة في الخط الجديد
CheckBoxIntoClauseInNewLine=INTO جملة في الخط الجديد
CheckBoxJoinClauseInNewLine=JOIN جملة في الخط الجديد
CheckBoxNewlineAfterComparisonOperator=سطر جديد بعد عامل مقارنة
CheckBoxNewLineAfterExists=EXISTS سطر جديد بعد
CheckBoxNewLineAfterIn=IN سطر جديد بعد
CheckBoxNewlineBeforeComparisonOperator=سطر جديد قبل عامل مقارنة
CheckBoxOrderByClauseInNewLine=ORDER BY جملة في الخط الجديد
CheckBoxTreatDistinctAsVirtualColumn=تعامل مع المميزة كدولة الاعمدة الافتراضية
CheckBoxWhereClauseAlignExpr=WHERE فقرة محاذاة
CheckBoxWhereClauseInNewline=WHERE جملة في الخط الجديد
ComboBoxAndOrLineBreak=الخط مقطوع
ComboBoxColumnListLineBreak=قطع السطر
ComboBoxColumnListStyle=الاسلوب
ComboBoxFromClauseStyle=الاسلوب
ComboBoxGroupByClauseStyle=الاسلوب
ComboBoxOrderByClauseStyle=الاسلوب
TabSheetAndOrKeyword=و/او كلمة
TabSheetColumnList=عمود القائمة
TabSheetFromJoinClause=FROM/JOIN فقرة
TabSheetGroupByClause=GROUP BY فقرة
TabSheetHavingClause=HAVING فقرة
TabSheetIntoClause=INTO فقرة
TabSheetOrderByClause=ORDER BY فقرة
TabSheetSubquery=فرعي

[OptionsSQLUpdateFrame]
ComboBoxColumnListStyle=اسلوب عمود القائمة

[OptionsSQLWhitespaceFrame]
CheckBoxSpaceAroundOperator=الفراغ حول المشغل للتعبير الحسابي
CheckBoxSpaceInsideCreate=المساحة داخل القوس في انشاء وظيفة / الاجراء
CheckBoxSpaceInsideExpression=مساحة الاقواس داخل في التعبير
CheckBoxSpaceInsideFunction=مساحة الاقواس داخل في استدعاء دالة
CheckBoxSpaceInsideSubquery=مساحة الاقواس داخل في الاستعلام الفرعي
CheckBoxSpaceInsideTypename== المساحة داخل الاقواس اسم النوع في انشاء الجدول

[OptionsStatusBarFrame]
CheckBoxShowCaretPosition=اظهر مراقبة الموقع
CheckBoxShowHints=تلميحات المعرض
CheckBoxShowKeyState=اظهر حالة المفتاح
CheckBoxShowMacro=عرض المختصر
CheckBoxShowModified=اظهر التعديل
CheckBoxShowSizeGrip:t= الترجمة المطلوبة
CheckBoxShowSizeGrip= اظهار قبضة الحجم
GroupBoxFont=الخط
GroupBoxFontSize=حجم الخط
RadioButtonFontCustom:t= الترجمة المطلوبة
RadioButtonFontCustom=مخصص
RadioButtonFontDefault:t= الترجمة المطلوبة
RadioButtonFontDefault=افتراضي
RadioButtonFontSizeCustom:t= الترجمة المطلوبة
RadioButtonFontSizeCustom=مخصص
RadioButtonFontSizeDefault:t= الترجمة المطلوبة
RadioButtonFontSizeDefault=افتراضي

[OptionsTitleBarFrame]
CheckBoxShowColorTheme:t= الترجمة المطلوبة
CheckBoxShowColorTheme= اظهار سمة اللون
CheckBoxShowEncoding:t= الترجمة المطلوبة
CheckBoxShowEncoding= اظهار الترميز
CheckBoxShowFileList:t= الترجمة المطلوبة
CheckBoxShowFileList=اظهار قائمة الملفات
CheckBoxShowFilename:t= الترجمة المطلوبة
CheckBoxShowFilename= اظهار اسم الملف
CheckBoxShowHighlighter:t= الترجمة المطلوبة
CheckBoxShowHighlighter=اظهار قلم تمييز
CheckBoxShowIcon=اظهار الايقونة
CheckBoxMagnifier:t= الترجمة المطلوبة
CheckBoxMagnifier= اظهار المكبر
CheckBoxUseSystemStyle=استخدم نمط النظام
GroupBoxFont=الخط
GroupBoxFontSize=حجم الخط
RadioButtonFontCustom:t= الترجمة المطلوبة
RadioButtonFontCustom=مخصص
RadioButtonFontDefault:t= الترجمة المطلوبة
RadioButtonFontDefault=افتراضي
RadioButtonFontSizeCustom:t= الترجمة المطلوبة
RadioButtonFontSizeCustom=مخصص
RadioButtonFontSizeDefault:t= الترجمة المطلوبة
RadioButtonFontSizeDefault=افتراضي

[OptionsToolbarFrame]
ActionAddDivider:h=اضافة مقسم
ActionAddDivider=اضف مقسما
ActionAddButton:h=اضف مادة
ActionAddButton=اضف مادة
ActionDelete:h=حذف
ActionDelete=حذف
ActionMoveDown:h=حرك المادة المحدد للاسفل
ActionMoveDown=تحريك للاسفل
ActionMoveUp:h=حرك المادة المحدد للاعلى
ActionMoveUp=تحريك للاعلى
ActionReset:h=استعادة مواد القائمة
ActionReset=استعادة
GroupBoxBackground=خلفية
GroupBoxIcons=الرموز
RadioButtonBackgroundHigh=متوسط
RadioButtonBackgroundLow=منخفض
RadioButtonBackgroundTransparent=شفاف
RadioButtonLargeIcons=كبير
RadioButtonSmallIcons=صغير
SpinEditMarginTop=الهامش العلوي
TabSheetButtons=وصفت
TabSheetOptions=الخيارات
VirtualDrawTree:0=مواد القائمة
VirtualDrawTree:h=استخدم السحب والاسقاط لتحريك مواد القائمة. اضغط الزر الايمن لادخال وحذف المواد.

[OptionsMenuBarItemsDialog]
ButtonCancel=الغاء الامر
ButtonOK=&موافق
Caption=اختر مواد
VirtualDrawTreeAddItems:0=مواد القائمة

[OptionsToolbarItemsDialog]
ButtonCancel=الغاء الامر
ButtonOK=&موافق
Caption=اختر مواد
VirtualDrawTreeAddItems:0=مواد القائمة

[PrintPreviewForm]
ActionColors:h=تثبيت الالوان
ActionColors=الالوان
ActionExit:h=خروج معاينة الطباعة
ActionExit=خروج
ActionFirst:h=اولا|اذهب الى الصفحة الرئيسية
ActionFirst=الاول
ActionHighlight:h=تثبيت البارز
ActionHighlight=تمييز
ActionLast:h=اخرا|اذهب الى اخر الفحة
ActionLast=الاخير
ActionLineNumbers:h=تثبيت رقم الخط
ActionLineNumbers=رقم الخط
ActionNext:h=التالي|اذهب الى الصفحة التالية
ActionNext=&التالي
ActionPrevious:h=السابق|اذهب الى الصفحة السابقة
ActionPrevious=&السابق
ActionPrint:h=طبع|اطبع المستند
ActionPrint=طباعة
ActionWordWrap:h=تثبيت التواء الكلمة
ActionWordWrap=التواء الكلمة
ActionZoom:h=كبر|تكبير وتصغير
ActionZoom=تكبير/تصغير
ActionZoomIn:h=تكبير
ActionZoomIn=تكبير
ActionZoomOut:h=تصغير
ActionZoomOut=تصغير
Caption=معاينة الطباعة

[ReplaceDialog]
ActionClose=&اغلاق
ActionFindNext=&اوجد التالي
ActionReplace=استبدال
ActionReplaceAll=&استبدال الكل
ActionSearchEngine=حدد محرك البحث
Caption=استبدال
CheckBoxMatchCase=حالة الاحرف
CheckBoxPromptOnReplace=اشر على الاستبدال
CheckBoxSelectedOnly=المحدد فقط
CheckBoxWholeWords=الكلمة الكاملة فقط
ComboBoxSearchFor=ابحث عن
GroupBoxDirection=اتجاه
GroupBoxOptions=اختيارات
GroupBoxOrigin=الاصل
GroupBoxReplaceIn=استبدال في
RadioButtonActiveFile=الملف الكامل
RadioButtonAllOpenFiles=كل الملفات المفتوحة
RadioButtonDeleteLine=حذف الخط
RadioButtonDirectionBackward=الى الوراء
RadioButtonDirectionForward=الى الامام
RadioButtonEntireScope=نطاق كامل
RadioButtonOriginFromCursor=من المؤشر
RadioButtonReplaceWith=استبدال مع

[SearchForFilesForm]
Caption=بحث عن ملفات
PanelSearchingFiles=يتم البحث عن ملفات...

[ShortcutsForm]
Caption=اختصارات
VirtualDrawTree:0=الاختصار
VirtualDrawTree:1=الشرح
VirtualDrawTree:2=المعلومة

[SkinPreviewForm]
Button1=زر +1
Button2=الزر 2
Caption=معاينة الشكل
CheckBox1=خانة اختيار 1
CheckBox2=خانة اختيار 2
Edit=النص
GroupBox=صندوق المجموعة

[SkinDialog]
ButtonCancel=الغاء الامر
ButtonDownloadAllSkins=تحميل كل الاغلفة
ButtonOK=&موافق
Caption=اختر نموذجا
CheckBoxAllowAeroBlurring=اسمح بالتعتيم الهوائي
CheckBoxAllowAnimation=السماح للرسوم المتحركة
CheckBoxAllowGlowing=السماج بالتوهج
CheckBoxAllowOuterEffects=السماح بالتاثيرات الخارجية
CheckBoxBlendOnMove=مزج الشكل عند التحرك
CheckBoxExtendedBordersMode=وضع امتداد الحدود
CheckBoxShowButtonFocusRect:t= الترجمة المطلوبة
CheckBoxShowButtonFocusRect= اظهار زر التركيز على المستقيم
CheckBoxUseCardGroupBoxStyle:t= الترجمة المطلوبة
CheckBoxUseCardGroupBoxStyle= استخدم نمط صندوق مجموعة البطاقات
CheckBoxUseButtonColors:t= الترجمة المطلوبة
CheckBoxUseButtonColors= استخدم الوان الزر
ComboBoxArrowStyle:t= الترجمة المطلوبة
ComboBoxArrowStyle= نمط السهم
ComboBoxOptimizingPriority:t= الترجمة المطلوبة
ComboBoxOptimizingPriority= تحسين الاولوية
GroupBoxFont:t= الترجمة المطلوبة
GroupBoxFont=الخط
LabelBrightness=السطوع
LabelHueOffset=تعديل الشكل
LabelSaturation=الاشباع
RadioButtonFontCustom:t= الترجمة المطلوبة
RadioButtonFontCustom=مخصص
RadioButtonFontDefault:t= الترجمة المطلوبة
RadioButtonFontDefault=افتراضي
RadioButtonFontFromSkin:t= الترجمة المطلوبة
RadioButtonFontFromSkin= من الجلد
TabSheetOptions=الخيارات
TabSheetPreview=معاينة

[SQLFormatterConstant]
AfterAndOr=بعد و/او
AfterComma=بعد الفارزة
BeforeAndOr=قبل و/او
BeforeComma=قبل الفارزة
BeforeCommaWithSpace=قبل الفارزة مع فراغ
Left=يسار
Lowercase=كشف الاوطئ
NoChange=لا تغيير
NoLineBreak=سطر مالانهاية
None=لاشئ
Right=يمين
SentenceCase=كشف الجملة
Stacked=جمع
Uppercase=كشف الاعلى
Wrapped=ملتوي

[TabsSelectDialog]
ButtonCancel=الغاء الامر
ButtonOK=&موافق
Caption:t= الترجمة المطلوبة
Caption= حدد التبويب
VirtualDrawTree:0=تبويب

[CharacterMapForm]
Caption=لوحة الرموز المشفرة

[WarningMessage]
FileAccessError=الملف %s خطا الوصول.